{
  "intents": [
    {
      "intent": "Can I continue application online after deadline has elapsed?",
      "text": [
        "I am wondering if it is possible to continue the application online after the deadline has elapsed.",
        "I have a deadline and I'm wondering if I can continue my application online.",
        "Can I continue my application online if the deadline has passed?",
        "Is it possible to continue applying online after the deadline has passed?",
        "After the deadline has passed, can I still apply online?",
        "Can I continue application online after deadline has elapsed?"
      ],
      "responses": [
        "If you purchased the form before the deadline, you will be considered to have purchased the form prior to the deadline.",
        "Only if you bought the form before the deadline.",
        "Only if you bought the form before the deadline.",
        "You only need to purchase the form before the deadline.",
        "Only if you purchased the form before the deadline.",
        "Yes, only If you purchased the form before deadline."
      ]
    },
    {
      "intent": "What do I do when I am unable to progress past the application review stage?",
      "text": [
        "When I'm not able to progress past my application review, what do I do?",
        "What do you do when you can no longer progress past the application review stage?",
        "When I am unable to progress past the application review stage, what do I do?",
        "What can I do when I am unable to progress past the application review stage?",
        "When I am not able to progress past the application review stage, what do I do?",
        "What do I do when I am unable to progress past the application review stage?"
      ],
      "responses": [
        "Please fill out the mandatory fields if you don't want to go through the lengthy process of reviewing and filling in your application.",
        "Please review and fill out the mandatory fields in your application, if you don't already have them.",
        "Please review your application and fill out the mandatory fields that aren't in it.",
        "Please fill in mandatory fields if your application doesn't include them.",
        "Please make sure to fill out the mandatory fields that are not included in your application.",
        "Please review your application and fill in the mandatory fields that are not filled in."
      ]
    },
    {
      "intent": "What do I do when I get to know I have been admitted (undergraduate)?",
      "text": [
        "When I find out that I've been admitted, what do I do?",
        "When I get to know I've been accepted for graduate school, what do I do?",
        "When I know I have been accepted for graduate school, what do I do?",
        "When I get to know I have been accepted to graduate school, what do I do?",
        "When I get the news that I have been accepted for graduate school, what should I do?",
        "What do I do when I get to know I have been admitted (undergraduate)?"
      ],
      "responses": [
        "You have to log onto the application and click on the login button to confirm your admission.",
        "When you log on to the app you can confirm your admission and print it out.",
        "Go to www.knst.edu.gh/admissions/ and log on, then you can print your admission out.",
        "You can log on to the app and confirm your admission by clicking on the link at the top of the page.",
        "Log on to the school's website and then you'll be able to confirm your admission and print it out.",
        "Log on to http://apps.knust.edu.gh/admissions/, click login, confirm your admission and print it out."
      ]
    },
    {
      "intent": "What is the address for the KNUST admission portal?",
      "text": [
        "Where is the address for the admission portal?",
        "The address for the admission portal is not known.",
        "The address for the admissions portal of KNUST has been asked of it's address.",
        "What is the email address for the admission portal?",
        "The address for the admissions portal for KNUST is not known.",
        "What is the address for the KNUST admission portal?"
      ],
      "responses": [
        "The admissions application can be downloaded from theapps.knust.edu.gh.",
        "There is an application available for the admissions at knust.edu.gh.",
        "There is an application for the school of knust.edu.gh.",
        "You can download the admissionss app at www.knust.edu.gh.",
        "Knust.edu.gh'sadmissions can be found in an application that is available on Apple's App Store.",
        "https://apps.knust.edu.gh/admissions/"
      ]
    },
    {
      "intent": "What is the cost of application forms for Foreign students?",
      "text": [
        "How much is the cost for application forms for foreign students?",
        "How much does it cost for application forms for foreign students?",
        "How much is it for application forms to be applied for by foreign students?",
        "What is the cost of application forms for foreign students?",
        "What is the application fee for foreign students?",
        "What is the cost of application forms for Foreign students?"
      ],
      "responses": [
        "You need to refer to the admission guidelines at www.knust.edu.gh.",
        "I would like to know whether or not you know the admission guidelines https://www.knusT.edu.gh/admissions/prospective/applying.",
        "I need to know the admission guidelines https://www.knutst.edu.gh/admissions/prospective/applying.",
        "You should reference the admission guidelines at https://www.knust.edu.gh/admissions/prospective/applying.",
        "You should refer to the admission guidelines at www.knust.edu.gh.",
        "Hi, Kindly refer to the admission guidelines https://www.knust.edu.gh/admissions/prospective/applying"
      ]
    },
    {
      "intent": "What should I do with the online print-out I get when I click the submit button on the system?",
      "text": [
        "When I click the submit button on the system, I get an online print-out, but what should I do with it?",
        "When I click the submit button on the system, I get an online print-out, but what should I do with it?",
        "I get an online print-out when I submit, but what should I do with it?",
        "When I click the submit button, what should I do with the online print-out?",
        "What should I do with the online print-out when I click the submit button?",
        "What should I do with the online print-out I get when I click the submit button on the system?"
      ],
      "responses": [
        "The online print-out should be used for admission forms for international students and for local students.",
        "There is an option to add online print-out to the admission forms that are used for international students and local students.",
        "International students and local students can add an online print out to their admission forms.",
        "The online print-out should be used when filling in the admission forms manually and also when sending the forms to a local student or to an international student.",
        "International students should have online print-out added to their admission forms.",
        "Online print-out should be added to the admission forms filled manually and posted through DHL (For International Students )or EMS Delivery Services (for local students)."
      ]
    },
    {
      "intent": "What type of browser is most efficient when applying Online on the KNUST admission portal?",
      "text": [
        "When applying online, what type of browser is most efficient?",
        "What type of browser is more efficient when you apply online?",
        "When applying online for admission, what type of browser is more efficient?",
        "When applying online, which browser is more efficient?",
        "What kind of browser is it that's most efficient when applying online?",
        "What type of browser is most efficient when applying Online on the KNUST admission portal?"
      ],
      "responses": [
        "Any modern browser is supported.",
        "Modern browsers that are supported are: The internet explorer, browser, Edge, and Opera are supported.",
        "Any modern Browser is supported, such as the internet explorer, browser, and opera.",
        "Any modern browser is supported, including the likes of browsers such as browsers like Chrome, Internet Explorer, Edge, and Opera.",
        "Any modern browser is supported, and includes browsers such as Internet Explorer, Chrome, Edge, and Opera.",
        "Google Chrome | Internet Explorer | Mozilla Firefox | Edge | Safari | Opera  Any modern Browser is supported"
      ]
    },
    {
      "intent": "When can I check my admission status as a graduate student?",
      "text": [
        "When can I check my admission status as a graduate student?",
        "I would like to know when I can check my admission status as a graduate student.",
        "When can I check my admission status as a graduate student?",
        "When can i check my admission status as a graduate student?",
        "Is it possible to check my admission status as a graduate student?",
        "When can I check my admission status as a graduate student?"
      ],
      "responses": [
        "This is decided by the department in charge of the programme.You'll be given the text to confirm your admission.",
        "The programme is run by a department.You'll receive a text message to confirm your admission.",
        "The department running the program can determine the extent to which this is determined.You'll receive a text message to confirm your admission.",
        "This is determined by the department that runs the programme.You'll get a text to confirm your admission.",
        "The department that runs the programme makes this determination.You'll receive a message from us to confirm your admission.",
        "This is determined by the department running the programme. You'll receive SMS to confirm your admission"
      ]
    },
    {
      "intent": "When can I check my admission status as an undergraduate student?",
      "text": [
        "I'm wondering when I can check my status as an undergraduate student.",
        "When can I see my status as an undergraduate student?",
        "Is there any way to check my status as an undergraduate student?",
        "I am a student and need to check my admission status.",
        "Can I check my status as an undergrad student when I'm done with school?",
        "When can I check my admission status as an undergraduate student?"
      ],
      "responses": [
        "You should check your admission portal frequently to be kept up-to-date on what's happening with Admission is still ongoing, you should check your admission portal frequently to be kept up-to-date on what's happening with Admission is still ongoing, you should check your admission portalThere is an application link that can be found on the website at theknust.edu.gh.",
        "You should check your admission portal frequently for updates, as admission is still ongoing.Use the link below if you're interested in applying foradmissions.knust.edu.gh",
        "You should check your portal frequently for any updates on admission, which is still ongoing.You can use the link if you're trying to sign in at the admissions application page in the knust.edu.gh website.",
        "If you don't check your admission portal frequently, you will not get the most up-to-date information.Click on the link below to log in to your Knust.edu.gh account.",
        "You should check your admission portal frequently for updates, as admission is still ongoing.You can use the link below to apply for admission to Kist.edu.gh.",
        "Admission is still ongoing; however, you should check your admission portal frequently for updates. Use the link below. https://apps.knust.edu.gh/admissions/apply/Account/Login?ReturnUrl=%2Fadmissions%2Fapply%2F"
      ]
    },
    {
      "intent": "When do we come to school?",
      "text": [
        "When do we go to school?",
        "We don't know when we'll come to school.",
        "When do we go to school?",
        "We don't know when we'll come to school.",
        "What time do we come to school?",
        "When do we come to school?"
      ],
      "responses": [
        "The days for reporting to school for both freshers and continuing students can be found beneath the academic calendar page on the university website.Click on academics then on the academic calender when you visit knust.edu.gh.You can click on this url to go directly to the academic calendar.",
        "The university's academic calendar page has the exact dates for freshers and continuing students to report to school.Click on academics, and then on the academic calender, when you visit knust.edu.gh.Click here to go directly to the academic calendar.",
        "On the academic calendar page of the university website, there is a list of exact dates for freshers and continuing students to report to school.Click on academics, and then on the academic calender when you visit knust.edu.gh.Click the following link if you'd like to go directly there.",
        "The academic calendar page on the university's website shows the exact dates for reporting to school for both freshers and continuing students.Visit the website and click on academics, then on the academic calender.Clicking on the following url will bring you to theacademics/academic-calendar.",
        "The university website has an academic calendar page with the exact dates of both freshers and continuing students reporting to school.Click on academics when you visit knust.edu.gh.Click here if you would like to go directly there.",
        "The exact dates for reporting to school for both freshers and continuing students can be found on the university website under the academic calendar page. Visit knust.edu.gh, click on academics, and then on academic calender. Or click the following url to go directly there. https://www.knust.edu.gh/academics/academic-calendar"
      ]
    },
    {
      "intent": "When do we start the sale of postgraduate application Forms for each successive academic year?",
      "text": [
        "When does the postgraduate application form go on sale for the next academic year?",
        "When can we sell postgraduate application forms for the next academic year?",
        "It is not known when the postgraduate application forms for each academic year will be put up for sale.",
        "When does the sale of postgraduate forms begin for the next academic year?",
        "When does the sale of postgraduate application forms begin for the next academic year?",
        "When do we start the sale of postgraduate application Forms for each successive academic year?"
      ],
      "responses": [
        "This is determined by the graduate school based on what they are interested in.On the website of the university, admissions are announced.You should refer to the guidelines for applying for admission at www.knust.edu.gh.",
        "The programme of interest is the reason why this is determined by the graduate school.On the KNUST website, admissions are announced.I would appreciate if you could tell me about the admission guidelines at https://www.knust.edu.gh/admissions/prospective/applying.",
        "The graduate school's programme of interest is the main factor in determining this.On the website there is an announcement of admissions.You should refer to the admission guidelines at www.knust.edu.gh.",
        "The program of interest is used to determine this.On the website, admissions are announced.You should refer to the admission guidelines at www.knust.edu.gh.",
        "The graduate school makes the determination based on the programme of interest.The admissions are announced on the website.You can refer to the admission guidelines at www.knust.edu.gh.",
        "This is determined by the Graduate school based on the programme of interest. Admissions are announced on the KNUST website.  Hi, Kindly refer to the admission guidelines https://www.knust.edu.gh/admissions/prospective/applying"
      ]
    },
    {
      "intent": "When do we start the sale of undergraduate application Forms for each successive academic year?",
      "text": [
        "The sale of undergraduate application Forms should start once again in the next academic year.",
        "Is it possible that we start selling undergraduate application Forms at a certain point in the academic year?",
        "When do undergraduate application forms go on sale?",
        "When do we start selling undergraduate application forms for the next academic year?",
        "We should start selling undergraduate application Forms for the following academic year.",
        "When do we start the sale of undergraduate application Forms for each successive academic year?"
      ],
      "responses": [
        "Dates might be different based on the program.The admission guidelines are at www.knust.edu.gh/admissions/prospective.",
        "Dates may be different based on the program.You should refer to the admission guidelines at: https://www.knust.edu.gh/admissions/prospective/applying.",
        "Dates may not be the same as they were in the case of the program.You must refer to the admission guidelines that can be found at www.knust.edu.gh.",
        "Dates may not be the same as shown on the program.You should refer to the admission guidelines at www.knust.edu.gh.",
        "Dates can be different depending on the program.The admission guidelines can be found at https://www.knst.edu.gh/admissions/prospective/applying.",
        "Dates may differ based on program. Kindly refer to the admission guidelines https://www.knust.edu.gh/admissions/prospective/applying"
      ]
    },
    {
      "intent": "Where are foreign students accommodated on campus?",
      "text": [
        "There are foreign students on the campus.",
        "Where do foreign students go when they are on campus?",
        "What is the location of foreign students on campus?",
        "Where are foreign students located?",
        "Where are foreign students located?",
        "Where are foreign students accommodated on campus?"
      ],
      "responses": [
        "The hostel for Foreign Students is on the University Campus.",
        "The University Campus has a hostel for foreign students.",
        "The University has a hostel for foreign students.",
        "Foreign students are provided a room at the University campus's GUSSS hostel.",
        "Foreign students are accommodated in a hostel at the University campus.",
        "All Foreign Students are accommodated at GUSSS Hostel within the University Campus."
      ]
    },
    {
      "intent": "Where are Ghanaian students accommodated on campus?",
      "text": [
        "Where are the students from the south located on the U.S. campus?",
        "Where are the students who are from the African nation?",
        "Where are the students from the other countries that are studying on the school's campus?",
        "Where are the students living when they're on campus?",
        "Where are you located for students from the other African countries?",
        "Where are Ghanaian students accommodated on campus?"
      ],
      "responses": [
        "The following are the halls of residence: Unity Hall (male), University Hall (male), Africa Hall (female), Independence Hall (mixed), Republic Hall (mixed) and Queen's Hall (mixed).",
        "The following are the halls of residence: Unity Hall, University Hall, African Hall, Independence Hall, Republic Hall, and Queen's Hall.",
        "Halls of residence are as follows: University Hall, Unity Hall, Africa Hall, Independence Hall, Republic Hall and Queen's Hall.",
        "There are seven halls of residence, of which the first one is Unity Hall, the second one is University Hall, the third is Africa Hall, the fourth is Independence Hall, and the fifth is Queen's Hall.",
        "The following are the Halls of residence: Unity Hall, University Hall, Africa Hall, Independence Hall, Republic Hall and Queen's Hall.",
        "Hall of residence are as follows: Unity Hall (male), University Hall(male), Africa Hall(female), Independence Hall(mixed), Republic Hall(mixed), Queen's Hall(mixed), Hall Seven(mixed)"
      ]
    },
    {
      "intent": "Where can I check my admission status as an undergraduate student?",
      "text": [
        "Where do I find out my admission status as an undergraduate student?",
        "I want to know if I can check my admission status as an undergraduate student.",
        "Is it possible to check my admission status as a student?",
        "I need to know if I'm accepted as an undergrad student.",
        "Where can I find the status of my application as an undergraduate student?",
        "Where can I check my admission status as an undergraduate student?"
      ],
      "responses": [
        "You can use the same portal and click on the check status link.",
        "The same admissions portal can be used to click on the check status link.",
        "Click the check status link if you use the same admission portal.",
        "You can check the status of your admission by using the same portal.",
        "The check status link is on the same portal as the admission portal.",
        "Use the same admission portal(apps.knust.edu.gh) and click the check status link."
      ]
    },
    {
      "intent": "Where can I purchase undergraduate application forms in Ghana?",
      "text": [
        "Where can I get undergraduate forms in the country of my choice?",
        "I'm wondering if there's a place where I can purchase undergraduate application forms.",
        "Is there a place to purchase application forms for undergraduate degrees in the country I'm thinking of moving to?",
        "Where can I find undergraduate application forms in the country that I'd like to live in?",
        "Is there a place in West Africa where I can buy undergraduate application forms?",
        "Where can I purchase undergraduate application forms in Ghana?"
      ],
      "responses": [
        "The forms can be obtained from any of the post offices, as well as selected banks.",
        "The application forms can be purchased at the regional and Designated Post Offices.",
        "Application forms can be obtained from selected banks and all Ghana Post Regional and Designated Post Offices.",
        "The application forms can be purchased from the regional and designated post offices, as well as selected banks.",
        "Application forms can be bought from all of the post offices in the country.",
        "Application forms can be purchased from all Ghana Post Regional and Designated Post Offices, including selected banks."
      ]
    },
    {
      "intent": "How can I reserve a computer lab for my class or training?",
      "text": [
        "Is there any way to reserve a computer lab for my class?",
        "Is it possible to reserve a computer lab for my class?",
        "Is it possible to reserve a computer lab for class or training?",
        "If I want to teach my class or training, what do I have to do to reserve a computer lab?",
        "I'm wondering how I can reserve a computer lab for my class.",
        "How can I reserve a computer lab for my class or training?"
      ],
      "responses": [
        "The ITS Lab Reservation website has a place for you to reserve a computer lab.It's a good idea to reserve a computer lab at least a week in advance to make sure your request is approved in a timely manner.",
        "You can reserve a computer lab using the ITS Lab Reservation website.If you reserve a computer lab at least a week in advance, you will be able to get your request approved in a timely manner.",
        "The ITS Lab Reservation website is where you can reserve a computer lab.It is advisable to reserve a computer lab at least a week in advance to ensure that your request is approved in a timely manner.",
        "There's a website where we can let you reserve a computer lab.It is recommended that you reserve the computer lab at least a week in advance so that your request can be approved in a timely manner.",
        "You can reserve a computer lab through the ITS Lab Reservation website.If you want your request to get approved in a timely manner, you must reserve a computer lab at least a week in advance.",
        "You can reserve a computer lab through our ITS Lab Reservation website. It is recommended that you reserve a computer lab at least a week in advance to guarantee your request is approved in a timely manner"
      ]
    },
    {
      "intent": "How can I update information on our college/departmental website",
      "text": [
        "I have a question about updating information on the college/departmental website.",
        "How can I keep up with what's happening on the college/departmental website?",
        "I'm having a question about updating information on our college website.",
        "How can I change the information on the college/departmental website?",
        "What can I do to change information on our website?",
        "How can I update information on our college/departmental website"
      ],
      "responses": [
        "If you'd like to put your information on your college's website, please contact your IT Administrator.",
        "Contact the IT Administrator at your college if you would like to put your information on the website.",
        "Please contact your college IT administrator if you want to put any information on your website.",
        "Contact the IT administrator for your college to place any information on the website.",
        "If you want to put information on the website of your department, please contact the IT Administrator of your college.",
        "To put any information on your college or department website, please contact your college IT Administrator"
      ]
    },
    {
      "intent": "I can’t access my Web site, what should I do?",
      "text": [
        "What should I do when I can't access my Web site?",
        "I can not access my Web site and what should I do?",
        "I can not access my website, what should I do?",
        "I cannot access my website, what should I do?",
        "What should I do if I can't access my Web site?",
        "I can’t access my Web site, what should I do?"
      ],
      "responses": [
        "First thing to do is make sure you have a network connection.Then you can find links to all the University's Web sites.",
        "If that is the case first check to see if there is a network connection.Follow this if you want to find all the Web sites in the University.",
        "If there's a network connection, first thing to check is if it's working.Then you'll find links to all the Web sites in the University.",
        "Check if you have a network connection.Follow this to find links to all of the Web sites in the University.",
        "Check if you have a network connection.Follow this to get to all the Web sites in the University.",
        "First check if have a network connection. Then follow this for links to all Web sites in the University."
      ]
    },
    {
      "intent": "Is there a choice of what links will appear in the left sidebar menu?",
      "text": [
        "Is there a choice about the links in the left sidebar menu?",
        "There's a left sidebar menu, and is it possible to choose the links to appear in it?",
        "Is there a choice of things to look out for in the left sidebar menu?",
        "Is there a choice of what links to look for in the left sidebar menu?",
        "I wonder if there will be a choice of links in the left sidebar menu.",
        "Is there a choice of what links will appear in the left sidebar menu?"
      ],
      "responses": [
        "Yes, it's true.For consistency and to orient the visitor, a common set of links is present on most college and departmental sites.The need for visitors to be provided with area-specific information inevitably will be the main focus of each area.",
        "Yes, there's truth to it.There are links on most college and departmental sites for consistency's sake and to orient the visitor.The need for visitors to access area specific information will always be present in each area.",
        "Yes.Most college and departmental websites present a common set of links for consistency's sake and to orient the visitor.Visitors will always need access to specific information in each area.",
        "Yes.The links present on most college and departmental sites are for the purpose of consistency and orienting the visitor.Visitors will need to find the information they are looking for in each area.",
        "There is no question that there is no question that it is no question that there is no discernable reason why it is no doubt that there is no doubt that there is no question that there is no doubt that there is no doubt that there is no doubt that there is no doubt that thereA set of links can be found on college and departmental sites to make sure you get to where you want to go.Visitors will need to have access to specific information in each area.",
        "Yes. A common set of links are present on most college and departmental sites for consistency's sake and to orient the visitor. Each area inevitably will have the need to provide visitors access to area-specific information"
      ]
    },
    {
      "intent": "Must every site have Related Links?",
      "text": [
        "Do every site have Related Links?",
        "It's a question about whether every site has Related Links.",
        "Is it possible every site has Related Links?",
        "Is there any reason every website should have Related Links?",
        "Is every site connected to Related Links?",
        "Must every site have Related Links?"
      ],
      "responses": [
        "Related Links are an optional feature and can be used to show links to information that may be difficult to find or that is of interest to visitors of a particular site.",
        "Related links are used to show off links to information that might otherwise be difficult to find and/or that would be of interest to visitors of a particular site.",
        "Links to information that might otherwise be hard to come by or that would be of interest to visitors of a particular site are the things that are featured in Related Links.",
        "Related Links are optional and can be used to show links to information that is difficult to find or that is of interest to visitors of a particular site.",
        "Links to information that might otherwise be difficult to find and/or that are of interest to visitors of a particular site can be featured in Related Links.",
        "No, Related Links are optional and are used to showcase links to information that might otherwise be difficult to find and/or that would be of interest to visitors of a particular site."
      ]
    },
    {
      "intent": "Where can I find the link to my Department Web site?",
      "text": [
        "Where can I find a link to the Department Web site?",
        "Where can I find the link to my website?",
        "I'm not sure where to find the link to the Department Web site.",
        "The link to my Department site is not located in a location where I can find it.",
        "I don't know where I can find the link to my Department Web site.",
        "Where can I find the link to my Department Web site?"
      ],
      "responses": [
        "Follow this link to find all the Web sites in the University.",
        "This is where you will find links to all of the University's Web sites.",
        "Follow this to get to all of the University's Web sites.",
        "Follow this link for more information on all of the University's Web sites.",
        "Follow this for links to all of the University's Web sites.",
        "Please follow this for links to all Web sites in the University"
      ]
    },
    {
      "intent": "Where can I report errors and other issues I find on any university Web site?",
      "text": [
        "Is there a place where I can report errors and issues on the website of the university?",
        "Where can I report my mistakes and other issues on the university website?",
        "Errors and other issues that I find on the university's website can be reported there.",
        "I'd like to submit errors and other issues to the university, but where can I do it?",
        "Errors and other issues I find on the university's Web site, where can I report them?",
        "Where can I report errors and other issues I find on any university Web site?"
      ],
      "responses": [
        "You can report your issues by following this link.",
        "Please report your issues by following this link.",
        "If you have issues, you can report them by following this link.",
        "You can report your issues by following this link.",
        "You can report your issues by following this link.",
        "Please follow this link to report your issues"
      ]
    },
    {
      "intent": "Where do I go to login to the CMS?",
      "text": [
        "Where can I find a password to log in to the content management system?",
        "Where should I go to sign up for the content management system?",
        "I do not know where I should go to log in.",
        "Where should I go to get my account set up?",
        "I want to log in to the content management system.",
        "Where do I go to login to the CMS?"
      ],
      "responses": [
        "The following documentation is for you to see.",
        "Please look at the documentation.",
        "You should see this documentation.",
        "There is a documentation that you may want to see.",
        "The following documentation needs to be seen.",
        "Please see the following documentation."
      ]
    },
    {
      "intent": "Am I to submit any hardcopy registration slip?",
      "text": [
        "Do I have to make a registration slip out of paper?",
        "I don't know if I can submit a hardcopy registration slip.",
        "Is it possible to submit a hardcopy registration slip?",
        "Is it possible to submit a paper registration slip?",
        "Do I have to submit a paper registration slip?",
        "Am I to submit any hardcopy registration slip?"
      ],
      "responses": [
        "Inquire from your department's Examinations Officer or programme co-ordinator.",
        "Inquire from the person that you work with, your department's Examinations Officer or programme co-ordinator.",
        "You can ask from your Department Examinations Officer.",
        "The Department Examinations Officer or the programme co-chairman might be able to give you an idea of what to ask.",
        "Inquire from the Examinations Officer of your department.",
        "Inquire from your Department Examinations Officer or Programme Coordinator"
      ]
    },
    {
      "intent": "Courses have not been set up for me to register. What should I do?",
      "text": [
        "I don't know if courses will be set up for me to register.What should I do?",
        "The courses have not been set up for me to register.I have no idea what to do.",
        "I don't know where I'll find courses that are set up for me to register.What should I do?",
        "I don't know what courses are going to be set up for me to register.I have no idea what to do.",
        "I can't register at this time because the courses haven't been set up.What should I do now that I'm aware of what's going on?",
        "Courses have not been set up for me to register. What should I do?"
      ],
      "responses": [
        "Go to the Examinations Officer or the Programme Director for the program you're working on.",
        "You should go to the Examinations Officer of your department.",
        "You should go to your Department Examinations Officer or Program co-cohort.",
        "You can go to your Examinations Officer.",
        "The department's Examinations Officer or a programme co-ordinator is a good person to ask for help with your department's exams.",
        "Go to your Department Examinations Officer or Programme Coordinator"
      ]
    },
    {
      "intent": "How can I correct a mistake with courses registered?",
      "text": [
        "How can I correct a mistake that has been made on a course?",
        "How can I correct a mistake that I've made on the courses that they're registered for?",
        "Is it possible to correct a mistake with courses that have been registered?",
        "What can I do to correct a mistake with courses that have been registered?",
        "How can I fix the mistake that my courses are registered for?",
        "How can I correct a mistake with courses registered?"
      ],
      "responses": [
        "Click on the link to register, then you need to download and install the KNUST Students Android Application from the app store, or go to your department's website.",
        "You can register for the course on the app, click online, or download the app and install it on your phone.",
        "Go to apps.knust.edu.gh to register and then download and install the app on your phone for the course that you wish to register for.",
        "To register for classes, click on the link and enter your student's password; if you do not have a password, you can download and install the app from the website, or alternatively register online by clicking on the link.",
        "Click Online registration, then click on your department to register, or click on the linked website to download and install the Students application from the app store.",
        "Go to apps.knust.edu.gh/students Login Click Online Registration Re-register Go to your Department Examinations Officer or Programme Coordinator Download and install the KNUST Students Android Application from https://apps.knust.edu.gh/knustaim/ Login Click Course Registration Re-register"
      ]
    },
    {
      "intent": "How do I change my programme option before I register courses?",
      "text": [
        "Before I register my courses, how do I change my programme option?",
        "How do I change the option for my program before it's too late to register for a course?",
        "Before I register for courses, do I have to change my programme option?",
        "How can I change my choice of program before I register for courses?",
        "How can I change my programme option before I register for a course?",
        "How do I change my programme option before I register courses?"
      ],
      "responses": [
        "You can go to the Examinations Officer or program co-ordinator in your department.",
        "Do you need an Examinations Officer or a programme co-ordinator?",
        "You could go to your Department Examinations Officer.",
        "You can go to your department Examinations Officer or a program co-ordinater.",
        "Go to the Examinations Officer for your department.",
        "Go to your Department Examinations Officer or Programme Coordinator"
      ]
    },
    {
      "intent": "How do I print my registration slip again after it is lost or destroyed?",
      "text": [
        "How do I get my registration slip back if it's lost or destroyed?",
        "What should I do when my registration slip is lost or destroyed?",
        "How do I get my registration slip back after it's lost or destroyed?",
        "How can I get a copy of my registration slip once it is lost or destroyed?",
        "How do I get my registration slip back after it has been lost or destroyed?",
        "How do I print my registration slip again after it is lost or destroyed?"
      ],
      "responses": [
        "Click on the registration slip that you want to use to sign up for the year and semester that you are interested in.",
        "Click the link in the app for students and then choose the academic year and semester you're interested in.",
        "You can register for the academic year and semester of interest if you go to the app.knust.edu.gh.",
        "Click the registration slip to see which year and semester of interest you're interested in.",
        "Click the slip to register for the academic year and semester of interest you're interested in.",
        "Go to apps.knust.edu.gh/students Login Click Registration Slip Select to academic year and semester of interest Follow the instructions"
      ]
    },
    {
      "intent": "How do I register a borrowed course in addition to my default causes?",
      "text": [
        "How can I make sure that I register a borrowed course and my default causes at the same time?",
        "I have a borrowed course but I don't know how to register it.",
        "Is it possible to register both a borrowed course and my default causes at the same time?",
        "How do I register a borrowed course?",
        "I want to register my borrowed course in addition to my default causes.",
        "How do I register a borrowed course in addition to my default causes?"
      ],
      "responses": [
        "The Department Examinations Officer is your go-to person when it comes to your department's exams.",
        "Go to your department's Examinations Officer.",
        "You can go to your Examinations officer or someone who works for them.",
        "There is a Department Examinations Officer who you might want to take a look at.",
        "Go to the Examinations Officer or the Programmecougar if you would like them to do it for you.",
        "Go to your Department Examinations Officer or Programme Coordinator"
      ]
    },
    {
      "intent": "How do I register a borrowed course in addition to my default causes? How do I defer a course already registered for the semester?",
      "text": [
        "How do I register a course that I borrowed in addition to my default causes?I'm trying to get a deferral on a course that was registered for the semester.",
        "How do I register a course that has been borrowed?What do I do with the course that will not be taken in the semester?",
        "How do I register courses that are borrowed from my default causes?I want to deferral a course that's been registered for the semester.",
        "I want to register a borrowed course in addition to my default causes.How do I get around to taking a course that is already registered for the semester?",
        "How can I register a borrowed course that's unrelated to my default causes?I am wondering how to change a course that is registered for the semester.",
        "How do I register a borrowed course in addition to my default causes? How do I defer a course already registered for the semester?"
      ],
      "responses": [
        "If online registration is ongoing, you can defer it by going to the course registration view of your portal.If online registration is over, you must contact your department Examinations Officer or program co-coordinator.",
        "If online registration continues, you can defer by going to the course registration view of your portal.If online registration is finished, you should contact your department's Examinations Officer.",
        "If online registration is still going on, you should defer it by going to the course registration view of your portal.You can check the Department Examinations Officer orProgramme Comissioner when online registration is over.",
        "If the online registration is still going on and you have a portal you would like to defer it, go to the course registration view of your portal.If you do not see a programme leader after online registration is over, you are either not literate or there is something wrong with you.",
        "You can defer online registration if it's continuing to go to the course registration view of your portal.If you can't find a programme you want, see your Department Examinations Officer.",
        "If online registration is ongoing, go to the Course Registration view of your portal and defer.  If online registration is over, see your Department Examinations Officer or Programme Coordinator"
      ]
    },
    {
      "intent": "How do I register courses for the semester?",
      "text": [
        "What do I need to do to enroll in courses for the semester?",
        "Is it possible to register courses for the semester?",
        "Is it possible to register courses for the semester?",
        "Is it possible to register courses for the semester?",
        "Is it possible to register courses for the semester?",
        "How do I register courses for the semester?"
      ],
      "responses": [
        "Go to the app, click online, and then follow the instructions to register for the course.",
        "Go to the app, follow the instructions and you can register for your course.",
        "You can register through the app.knust.edu.gh or by clicking on the link below: Click on the link below to join; follow the instructions; then download the app and install it on your phone.",
        "Go to apps.knust.edu.gh to register and follow the instructions to download the app and install it on your phone.",
        "You can register online at apps.knust.edu.gh, follow the instructions to register and download and install the studentsapp from the app store.",
        "Go to apps.knust.edu.gh/students Login Click Online Registration Follow the instructions Go to your Department Examinations Officer or Programme Coordinator Download and install the KNUST Students Android Application from https://apps.knust.edu.gh/knustaim/ Login Click Course Registration Follow the instructions"
      ]
    },
    {
      "intent": "How do I submit my registration slip after registration?",
      "text": [
        "What do I do to submit my registration slip after I register?",
        "How do I turn in my registration slip after I register?",
        "Is it possible for me to submit a registration slip after registration?",
        "I don't know how to submit a registration slip after registration.",
        "How do I submit my registration slip after a certain period of time?",
        "How do I submit my registration slip after registration?"
      ],
      "responses": [
        "You will receive a copy of your registration slip in your inbox once it's submitted electronically to the school.",
        "Your registration slip will be uploaded to the school's website and you will be given a copy of it in your inbox.",
        "You'll be sent a copy of your registration slip in your inbox when you submit it electronically to the school.",
        "You will receive a copy of your registration slip in your inbox after you submit it electronically to the school.",
        "Your registration slips will be submitted online to the school and you will be able to get a copy in your inbox.",
        "Your registration slip will be submitted electronically to the school and a copy will be sent to your inbox."
      ]
    },
    {
      "intent": "I am expected to change my programme option myself to continue registration. How do I do that?",
      "text": [
        "I will have to change my programme option in order for registration to continue.What do I have to do to do that?",
        "I need to change my programme option to be able to continue registration.How do I make that happen?",
        "I am expected to choose a different option to continue with my registration.What do I do to do that?",
        "It's expected that I will change my programme option to continue registration.What do I do to do that?",
        "My programme option is expected to be altered by me in order to continue registration.How am I supposed to do that?",
        "I am expected to change my programme option myself to continue registration. How do I do that?"
      ],
      "responses": [
        "If you want to change your option, you must go to the programme information page.To achieve this, you must register at the registration and then change at the change option.",
        "If you're on the Students portal, you'll be able to change your option if you're on the programme information page.Go to registration and change your mind.",
        "If you'd like to change your option, you must go to the programme information page.You have to register and go to the change option.",
        "You can change the option if you go to the programme information page.Go to registration and change your mind.",
        "If you want to change your option, go to the Students Portal and do it with the help of the programme information page.Go to registration and change your mind.",
        "Students Portal: Go to the Programme Information page and change your option, if enabled. KNUST Aim: Go to Registration and go to change option."
      ]
    },
    {
      "intent": "I do not have clearance to register online since I have fee arrears. What should I do?",
      "text": [
        "I have arrears on my fees so I don't have clearance to register online.What should I do?",
        "I have fee arrears so I do not have clearance to register online.I need to know what to do.",
        "I have fee arrears so I do not have clearance to register online.I don't know what to do.",
        "Since I have fee arrears, I am not allowed to register online.I have no idea what to do.",
        "I have fee arrears so I don't have clearance to register online.What should I do?",
        "I do not have clearance to register online since I have fee arrears. What should I do?"
      ],
      "responses": [
        "To get clearance, you must go to the Students Section of the Main Finance Office.",
        "To get a clearance, you should go to the Students Section of the Main Finance Office.",
        "The Students Section of the Main Finance Office is where to go if you want to get a clearance.",
        "You can get clearance from the Students' Section of the Main Finance Office.",
        "You can get clearance by going to the Student Section of the Main Finance Office.",
        "Go to the Students’ Section of the Main Finance Office to seek clearance"
      ]
    },
    {
      "intent": "I have issues with minimum/maximum credit for the set courses. What do I do?",
      "text": [
        "I have issues with the minimum and maximum credit that are in the set courses.What are I supposed to do?",
        "There are issues with minimum/maximum credit for the set courses.I don't have a clue what to do.",
        "Minimum/maximum credit for the set courses is a problem for me.I don't know what to do.",
        "I have trouble with the minimum and maximum credit for the set courses.I have no idea what to do.",
        "Minimum credit is an issue for the set courses.What am I supposed to do?",
        "I have issues with minimum/maximum credit for the set courses. What do I do?"
      ],
      "responses": [
        "The examination officer or department would love to hear from you.",
        "Call your department to inquire about your examinations officer.",
        "Contact your officer or department to find out about your exams.",
        "Contact the department or examination officer who you are doing the exams with.",
        "Contact the department or examination officer to inquire about your exams.",
        "Contact your examinations officer or department"
      ]
    },
    {
      "intent": "I have issues with selecting courses from elective sets. What do I do?",
      "text": [
        "I can't figure out how to pick courses from the non-elective sets.I have a question about what to do.",
        "I am having difficulty with selecting courses from elective sets.I don't know what to do.",
        "I don't like choosing courses from non-elective sets.What am I supposed to do?",
        "I am not happy with the choices I make about the courses from the elective sets.What am I supposed to do?",
        "I don't like choosing courses from non-elective sets.What am I supposed to do?",
        "I have issues with selecting courses from elective sets. What do I do?"
      ],
      "responses": [
        "Call the department you want to speak to or the examination officer you want to speak to.",
        "You can contact the department or the examination officer.",
        "Contact the department or the examinations officer for more information.",
        "Contact the examinations officer or department to inquire about your exams.",
        "If you have a question, please contact the examinations officer or department.",
        "Contact your examinations officer or department."
      ]
    },
    {
      "intent": "I have minimum/maximum credit issues with course registration. What should I do?",
      "text": [
        "I don't have the credit I need for course registration.What should I do?",
        "I have some issues with course registration, there is minimum and maximum credit that I have.What should I do now that I know what to do?",
        "There are minimum and maximum credit issues with the course registration.What should I do?",
        "I have some credit issues with the course registration, I have minimum/maximum credit issues.What should I do?",
        "I have credit issues with the course registration.What should I do?",
        "I have minimum/maximum credit issues with course registration. What should I do?"
      ],
      "responses": [
        "The department's Examinations Officer orProgramme co-ordinates are the appropriate people to go to.",
        "You can go to your Examinations Officer or the programme co-ordinator.",
        "Go to the Examinations Officer or the Programme Administrator for your department.",
        "The Examinations Officer or the programme co-ordinater is the one you should go to.",
        "You can go to your Department Examinations Officer or a programme co-cohort.",
        "Go to your Department Examinations Officer or Programme Coordinator"
      ]
    },
    {
      "intent": "What happens when I contact the E-learning Support Centre?",
      "text": [
        "When I contact the E- learning Support Centre, what happens?",
        "What happens when I call the E-learning Support Centre?",
        "What do I do when I get in touch with the E-learning Support Centre?",
        "What happens if I call the E-learning Support Centre?",
        "How will I know if I am talking to the E-learning Support Centre?",
        "What happens when I contact the E-learning Support Centre?"
      ],
      "responses": [
        "There are three ways you can reach out to the E-learning Support Centre.If you are able to reach us through the phone, we would love the chance to hear from you.If you write down your contact info, you can be certain the technician will be able to get in touch with you.2.You will get all the details that you need to understand the situation and resolve it.There are no words to describe the feelings we have about 3.If a call ticket is issued, you will get an email with your ticket details, after the assignment of your ticket.The following is a list of 4.You will hear something from the person you are talking to.If you enter your issue on the web, we'll get in touch with you.If there is more information you need to know, get in touch with me, and I'll check the data you provided.2.Send the ticket to the correct department, or get someone to come and talk to you about the problem.There is no doubt in my mind that 3.If there is a call ticket produced, you should send an email with the ticket details.The following is an average of the numbers 4 to 4.You'll hear something from the technician.We'll be able to contact us via email if it's possible.Provide information in the response and review the email.An email containing the ticket's details will be sent to you when you enter a call ticket.If you manage to resolve your issue yourself, or you no longer have the problem, please contact the E-learning Support Centre so that we can update your call ticket information.At any time of the day or night, you can call the E-learning Support Centre to change or update your call ticket information.",
        "You can contact the E-learning Support Centre online, by phone or in person.If you contact us by phone, we'd love to hear from you.If you write down your contact information, a technician will be able to get in touch with you.2.We will be able to get all the information you need to understand the situation and resolve it.3.If there is a call ticket, you will get an email with the ticket details and the assignment of your ticket.The list of numbers has been revised from 4 to 4.You'll be able to hear what the technician is saying.We will allow you to enter your issue via the web.If more information is required, you may want to get in touch with us.It is the 2nd thing that comes to my mind.If you send your ticket to the proper department, someone can call you to discuss the problem.3.If a call ticket is produced send an email with the ticket details.It's not the number 4, it's the number 4.You will hear from the person who is doing the work.If you want to contact us by email, we will be glad to do so.Provide information in the response or 2 after you have reviewed the email.You will get an email with the ticket's details when you enter a call ticket.If you solve your problem on your own, or no longer have to worry about it, please give us a call at the E-learning Support Centre so the call ticket information can be updated.You are able to change or update your call ticket information at any time, by calling the E-learning Support Centre.",
        "You can contact the e-learning support centre by phone, mail or on the internet.If you call us, you'll be asked if it's a phone call or not.If you write down your information, you can be certain that the technician will still be able to get in touch with you.The following is a list of the following: 2.We'll be able to get the information you need to get to the bottom of the situation.3.If there is a call ticket issued, you will get an email with your ticket details, after the assignment of your ticket.There are at least four things that happened in this day and age.There's a technician who's going to tell you what's going on.We'll let you know if you enter your issue via the web.You should check the data you provided and if more is required, get in touch with us.2.If you want someone to discuss the problem, you need to send the ticket to the proper department.3.If a call ticket is created, you should send an email with the ticket details.There are 4.The technician will talk to you.If you can email us, we will be happy to hear from you.Provide the information in response to the email, so you have a chance to review it.You will receive an email containing the ticket's details when you enter a call ticket.If you manage to solve your problem on your own, or get rid of it, please call the E-learning Support Centre so that we can update your call ticket information.You can change or update your call ticket information by calling the E-learning Support Centre.",
        "You can use one of the three ways to reach the E-learning Support Centre.If you use the phone to contact us, we want you to tell us as soon as possible.You should write down your contact information in order for a technician to get in touch with you.2.We'll get all of the details you require to understand and resolve the situation.3.If there is a call ticket, you will get a email with the ticket details following the assignment of your ticket.There are 4.The technician is going to give you the intel you'll need to make a decision.If you go to the web, we will allow you to enter your issue.If more information is required, get in touch with you, and check the data you provided.2.Have someone call you to explain the problem if you send the ticket to the proper department.3.If a call ticket is produced, you need to include the ticket details in an email.There are four things to think about in this week's edition of SALVAGEDATA SALVAGEDATA SALVAGEDATA SALVAGEDATA SALVAGEDATA SALVAGEDATA SALVAGEDATA SALVAGEDATA sums up what SALVAGEDATA SALVAGEDATA SALVAGEDATA SALVAGEDATA SALVAGEDATA SALVAGEDATA sums up how SALVAGEDATA SALVAGEDATA SALVAGEDATA SALVAGEDATA SALVAGEDATA SALVAGEDATA SALVAGEDATA SALVAGEDATA SALVAGEDATA SALVAGEDATA SALVAGEDATA SALVAGEDATA SALVAGEDATA SALVAGEDATA SALVAGEDATA SALVAGEDATA SALVAGEDATA SALVAGEDATA SALVAGEDATA SALVAGEDATA SALVAGEDATA SALVAGEDATA SALVAGEDATA SALVAGEDATAYou'll hear from a person in the technician's office.If you send us an email, we will respond: 1.Email will be reviewed, and information provided in response or 2.An email containing the ticket's details will be sent to you when you enter a call ticket.If you can resolve your problem on your own, please contact the E-learning Support Centre so we can update your call ticket information, if you no longer have the problem.You can call the E-learning Support Center at any time to change, add, or change the information on your call ticket.",
        "There are a number of ways to reach the E-learning Support Centre.If you are able to reach us on the phone, you will know what we are up to.If you write down your contact information, the technician will be able to reach you.There is only two things that can be said about 2.All the details you need to fully understand the situation and resolve it will be obtained by us.3.If a call ticket is issued, you will receive an email containing the ticket details, after the assignment of your ticket.There was a rating of 4.You'll hear from the person who answered the phone.We will allow you to use the web to enter your issue.If there are more information that needs to be disclosed, please get in touch with me.2.You can either send the ticket to the department that handles it or get someone to talk to you about the problem.3.If a call ticket is produced, you can send an email with the ticket details.There are 4.You'll hear from the person who works at the technician's place of business.If you can email us, we'll do it.Please provide information in response to the email.You'll receive an email with the ticket's details when you enter a call ticket.If your problem is resolved on its own, or if you no longer have the problem, then you should call the E-learning Support Centre, so we can update your call ticket information.You can update or change your call ticket at any time by calling the E-learning Support Centre.",
        "There are three ways you can contact the E-learning Support Centre. If you contact us by phone:   1. You can be sure a technician will be able to reach you if you write down your contact information.   2. We will obtain all the details you need to fully understand the situation and resolve them.   3. Following the assignment of your ticket, you will get an email with the ticket details if a call ticket is issued.   4. You'll hear from a technician. If you enter your issue via the web, we will:   1. Check the data you provided, and if more information is required, get in touch with you.   2. Send your ticket to the proper department, or have someone call you to discuss the problem.   3. Send an email including the ticket details if a call ticket is produced.   4. You'll hear from a technician. If you can contact us via email, we will: 1. Review the email and provide information in response OR 2. When you enter a call ticket, you will receive an email containing the ticket's details. If you manage to resolve your problem on your own, or you are no longer having the problem, please call the E-learning Support Centre so we can update your call ticket information. You can call the E-learning Support Centre at any time to change or update your call ticket information."
      ]
    },
    {
      "intent": "What is the e-mail address for the E-learning Support Centre?",
      "text": [
        "What email address is used for the E-learning Support Centre?",
        "What is the E-learning Support Center's e-mail address?",
        "The E-learning Support Centre has an e-mail address.",
        "The E-learning Support Centre does not have an e-mail address.",
        "There is an e-mail address for the E-learning Support Centre.",
        "What is the e-mail address for the E-learning Support Centre?"
      ],
      "responses": [
        "The e-mail address of the E-learning Support Centre is knusts22@gmail.com.",
        "The email address of the E-learning Support Centre is knusts22@gmail.com.",
        "The email address for the E-learning Support Centre is knusts22@gmail.com.",
        "The e-mail address of the E-learning Support Centre is knusts22@gmail.com.",
        "The e-mail address for the E-learning Support centre is knusts22@gmail.com.",
        "The E-learning Support Centre e-mail address is knusts22@gmail.com. "
      ]
    },
    {
      "intent": "What is the phone number to the E-learning Support Centre?",
      "text": [
        "What is the telephone number for the E-learning Support Centre?",
        "What's the phone number for the E-learning Support Centre?",
        "What's the phone number to the E-learning Support Centre?",
        "What is the contact number for the E-learning Support Centre?",
        "What is the phone number for the E-learning Support Centre?",
        "What is the phone number to the E-learning Support Centre?"
      ],
      "responses": [
        "If you want to reach the E-learning Support Centre, you might as well call it from an on-campus phone.Cell phones and other phones that aren't on the school's campus needs to dial +233 24 507 7483 in order to get to the Support Centre.",
        "The E-learning Support Centre888-607-3166 can be888-607-3166, and you can888-607-888-607-3166 by calling the E-learning Support Centre888-607-3166 from any on-campus phone.If you are using a phone off-campus, you have to call +233 24 507 7483 in order to get to the Support Centre.",
        "The E- learning Support Centre can be reached by calling the toll free hotline at 888-666-1846 888-666-1846 888-666-1846 888-666-1846 888-666-1846 888-666-1846 888-666-1846 888-666-1846 888-666-1846 888-666-1846 888-666-1846 888-666-1846 888-666-1846 888-666-1846 888-666-1846 888-666-1846 888-666-1846 888-666-1846 888-666-1846 888-666-1846 888-666-1846 888-666-1846 888-666-1846 888-666-1846 888-666-1846 888-666-1846 888-666-1846 888-666-1846 888-666-1846 888-666-1846 888-666-1846 888-666-1846 888-666-1846 888-666-1846 888-666-1846 888-666-1846 888-666-1846 888-666-1846 888-666-1846 888-666-1846 888-666-1846The Support Centre requires off-campus phones, such as cell phones, to be dialled +233 24 507 7483 in order to reach it.",
        "You can get in touch with the E-learning Support Centre on your phone at any of the on-campus phone numbers.To reach the support centre, calls from phones located off-campus, including cell phones, need to be made on +233 24 507 7483.",
        "The on-campus phone can be used to reach the E-learning Support Centre.To reach the Support Centre, cell phones and other phones that are off-campus need to be dialled +233 24 507 7483.",
        "The E-learning Support Centre can be reached from any on-campus phone by dialling VoIP 440109/440111.  Phones located off-campus, including cell phones, will need to dial  +233 24 507 7483 in order to reach the Support Centre. "
      ]
    },
    {
      "intent": "What services does the E-learning Support Centre offer?",
      "text": [
        "What services do the E-learning Support Centre offer?",
        "What services is offered by the E-learning Support Centre?",
        "What services do the E-learning Support Centre offer?",
        "What services is offered by the E-learning Support Centre?",
        "What are the services available at the E-learning Support Centre?",
        "What services does the E-learning Support Centre offer?"
      ],
      "responses": [
        "Email KNUST password assistance is provided for the setup of IT services.",
        "Student portal issues, password assistance for IT service, and Virtual classroom guidelines are supported by the support of IT services.",
        "The support for IT services setup is Email KNUST password assistance.",
        "Support for IT services setup, password help, student portal issues, and more.",
        "There is support for IT services setup, email and password assistance, student portal issues, and virtual classroom guidelines.",
        "Support for IT services Email setup KNUST password assistance Student portal login issues WIFI connectivity Student Registration Virtual Classroom Zoom Guidelines"
      ]
    },
    {
      "intent": "Where is the E-learning Support Centre Located?",
      "text": [
        "The E-learning Support Centre is not located where you would expect it to be.",
        "What is the location of the e-learning support centre?",
        "Where is the E-learning Support Centre located?",
        "What is the location of the E-learning Support Centre?",
        "The E- learning Support Centre is located on the other side of the country.",
        "Where is the E-learning Support Centre Located?"
      ],
      "responses": [
        "The Evans Anfom auditorium has a E-learning Support Centre on the ground floor.",
        "The Evans Anfom auditorium has the E-learning Support Centre on the ground floor.",
        "The ground floor of the CCB auditorium is where the E-learning Support Centre is located.",
        "The Evans Anfom auditorium is home to the E-learning Support Centre.",
        "The Evans Anfom auditorium has a E-learning Support Centre on the ground floor.",
        "The E-learning Support Centre is located at the ground floor of the Evans Anfom Auditorium (CCB auditorium). "
      ]
    },
    {
      "intent": "Who is eligible to benefit from the services provided by the E-learning Support Centre?",
      "text": [
        "Who are eligible to receive services from the E-learning Support Centre?",
        "Who is Eligible for the Services provided by the E-learning Support Centre?",
        "Who are the people that are eligible to receive services from the E-learning Support Centre?",
        "Who is eligible for services provided by the E-learning Support Centre?",
        "Who are eligible to benefit from the services offered by the E-learning Support Centre?",
        "Who is eligible to benefit from the services provided by the E-learning Support Centre?"
      ],
      "responses": [
        "Anyone who needs help is welcome at the E-learning Support Centre.",
        "Anyone who needs assistance can go to the E-learning Support Centre.",
        "Anyone who requires assistance can come to the E-learning Support Centre.",
        "Anyone who requires assistance can come to the E-learning Support Centre.",
        "Anyone who needs assistance is welcome at the E-learning Support Centre.",
        "The E-learning Support Centre is open to anyone who requires assistance."
      ]
    },
    {
      "intent": "What happens when I contact the Help Desk?",
      "text": [
        "What happens when I contact the help desk?",
        "When I call the help desk, what happens?",
        "When I contact the help desk, what happens?",
        "When I contact the help desk, what happens?",
        "When I call the Help Desk, what happens?",
        "What happens when I contact the Help Desk?"
      ],
      "responses": [
        "If you want us to contact you by phone, we will record your contact information, which will make it easier for our technician to get in touch with you.If necessary, you can gather information and try to figure out what the problem is.If a call ticket is issued, you will get an email with your ticket's information after it's assigned.A technician will be in touch with you.If you use the web to submit your issue, we'll review the information you submit and contact you if necessary.You can either resolve the issue by calling or sending the ticket to the appropriate department.If a call ticket is issued, you will get an email with the ticket information.A technician will get in touch with you.If you can email us, we will give you an email with the ticket information, at which point you will be able to call us.If you are able to resolve your issue on your own or you are no longer able to, please call the help desk so that we can update your call ticket information.You can change or update your call ticket information by calling the Help desk at any time of the day or night.",
        "If you want us to know your contact information, record it, and our technician will be able to get in touch with you.If you have a problem, you should gather all the information you can about it and figure it out.You will get an email with the ticket information after it's assigned if you receive a call ticket.A technician will get in touch with you.We will review the information you entered and contact you to clarify if necessary if you enter your issue via the web.Call to resolve the problem or send it to the department that you want your ticket to go to.You'll be receiving an email with the ticket information if you get a call ticket.You will be contacted by a technician.When you get an email with a call ticket, you'll get an email with the ticket information, at which point you'll be able to contact us via email.If you are able to resolve the problem on your own, or you no longer have the problem, please call us so that we can update your call ticket information.You can change or update your call ticket information at any time, if you call the help desk.",
        "If you contact us by phone we will make sure that the technician will be able to get in contact with you, by recording your contact information.Information about the problem should be gathered, and the issue should be checked out if it's appropriate.If you receive an email with your ticket information, that's because you were issued a call ticket.A technician will get in touch with you.If you enter your issue via the web, we will review your information and contact you to clarify if necessary.Call if you need to resolve the issue or write a ticket that will be sent to the department that made the ticket in the first place.You will get an email containing the ticket information if you receive a call ticket.You will be contacted by a technician.We will either review your email and respond with information or enter a call ticket at the point where you will get an email with the ticket information.If you are not able to resolve the problem on your own and are no longer having it, please call the Help desk so that we can update your call ticket information.You can call the Help Desk at any time to change or update your call ticket information.",
        "When you contact us on the phone we will record your contact information, which will allow a technician to get in touch with you.If you have a problem, get complete information about it, and try to find a solution.After your ticket has been assigned, you'll receive an email with the ticket information.A technician is going to be on the phone with you.If you use the internet, we will review the information you enter and let you know if there's anything we need to know.You could either resolve the issue by calling, or send the ticket to the appropriate department.You will get an email if there is a call ticket.A technician will be in touch with you.If you contact us by email, we will either: Review the email and respond with information or Enter a call ticket at this point, which will give you an email with the ticket information.If you can't solve the problem on your own or you're no longer having the problem, please call the Help desk, so we can update your call ticket information.You can call the Help desk and change or update your call ticket information.",
        "If you use the phone, we can record your contact information to ensure that a technician will be able to get in touch with you.Information about your issue should be obtained and you should be able to figure out what the problem is.After the ticket is assigned you will be able to get an email with the ticket information.A technician will get in touch with you.If you use the internet to submit a problem, we can review the information you submit, and contact you if necessary.Call to resolve the issue and send your ticket to the appropriate department.You'll get a email with the ticket information if you get a call ticket.You will be contacted by a technician.If you can use email, we will review it and respond with information, or if you call, we'll give you an email with the ticket information.If you are able to resolve the problem on your own, please call the Help Desk, so that we can update your call ticket information.The Help Desk can change your call ticket information, and you can do so at any time.",
        "If you contact us by phone, we will: Record your contact information, which ensures that a technician will be able to get into contact with you. Gather complete information about your issue and troubleshoot the problem if appropriate. If a call ticket is issued, you will receive an email with the ticket information after your ticket is assigned. A technician will contact you. If you enter your issue via the web, we will: Review the information you entered and contact you to clarify if necessary. Either call you to resolve the issue or send your ticket to the appropriate department. If a call ticket is issued, you will receive an email with the ticket information. A technician will contact you. If you can contact us via email, we will: Review the email and respond with information OR Enter a call ticket, at which point you will get an email with the ticket information. If you manage to resolve your problem on your own, or you are no longer having the problem, please call the Help Desk so we can update your call ticket information. You can call the Help Desk at any time to change or update your call ticket information."
      ]
    },
    {
      "intent": "What is the e-mail address for the Help Desk?",
      "text": [
        "The help desk has an e-mail address.",
        "The Help Desk has an e-mail address.",
        "What is the email address for the Help Desk?",
        "The Help Desk has an e-mail address.",
        "What is the e-mail address for the help desk?",
        "What is the e-mail address for the Help Desk?"
      ],
      "responses": [
        "The KNUST can also be reached via e-mail from any computer with a valid internet connection, as long as they have a valid internet connection.The e-mail address for the KNUST is checked multiple times throughout the day, but it is the helpdesk@knust.edu.gh.User can contact the Student Helpdesk any time and expect a professional response to their inquiry.",
        "The Helpdesk can be reached by email from any computer that has a valid internet connection.Even on holidays, the KNUST e-mail address is checked multiple times.A user can contact the Student Helpdesk whenever, and expect a prompt and professional response to their inquiry.",
        "The KNUST can be contacted via e-mail from any computer that has a valid internet connection.Every day, the KNUST e-mail address is checked multiple times, even on holidays.A user can contact the Student Helpdesk at any time and be assured of a prompt and professional response to their inquiry.",
        "The KNUST can be contacted via email from all of the computers that have a valid internet connection.The Helpdesk e-mail address is checked all the time, even on holidays.Users can get a response from the Student Helpdesk whenever they need it, because they can contact it at any time.",
        "The KNUST can be contacted via email, and it's possible to do it from a computer with a valid internet connection.The KNUST e-mail address is checked multiple times throughout the day, even on holidays, if the e-mail address is helpdesk@knust.edu.gh.A user can contact the Student Helpdesk at any time, and they can expect a professional response to their inquiry.",
        "The KNUST Helpdesk can also be contacted via e-mail from any computer with a valid internet connection. The KNUST Helpdesk e-mail address is helpdesk@knust.edu.gh This e-mail address is checked multiple times throughout the day even on holidays. Therefore, a user can contact the Student Helpdesk anytime and expect a prompt and professional response to their inquiry."
      ]
    },
    {
      "intent": "What is the phone number to the Help Desk?",
      "text": [
        "What is the phone number for the help desk?",
        "How come I don't know the Help Desk's phone number?",
        "Where can I find the help desk phone number?",
        "The help desk phone number is something that I don't know.",
        "What is the toll-free number for the help desk?",
        "What is the phone number to the Help Desk?"
      ],
      "responses": [
        "The KNUST is reachable from all on-campus phones by calling 1726/35511.cell phones and other off-campus phones have to call the helpdesk to get to it.During hours, a Student Helpdesk Support Technician will answer the call.In order to get through to someone after hours, a user will need to give a detailed message including their name, a phone number, and a description of the issue.",
        "The KNUST can be reached from any on-campus phone, no matter what time of the day it is.To get to the helpdesk, phones located off-campus, including cell phones, will need to dial a certain number.A technician is on duty during the day and on duty during the night.If a user calls after hours, they must leave a detailed message that includes their name, phone number and a brief description of the issue.",
        "The phone number to reach the KNUST Helpdesk is 17026/35511.Cell phones, which are located off-campus, will need to be dialled in order to get to the helpdesk.A student technician will answer the call in the middle of the night.The user need to leave a detailed message with their name, phone number, and a brief explanation of the issue, if they're in the middle of the night.",
        "The KNUST can be reached on any of the phone numbers on the school's campus.There are cell phones off-campus that have to be dialled in order to get to the help desk.A Student Support Technician is available to answer the call at all hours of the day and night.The user needs to make a detailed message that includes their name, phone number, and brief description of their problem, if they are calling after hours.",
        "If you're on the campus, you can call the KNUSTHelp desk at any on-campus phone.Cell phones, as well as phones that are off-campus, need to dial the hotline in order to get to the trouble-shooting desk.A technician will answer the call when it's convenient for them.A brief description of the issue, a phone number where they can be reached, and a detailed message are required if the user is calling in after hours.",
        "The KNUST Helpdesk can be reached from any on-campus phone by dialing VoIP 17026/35511. Phones located off-campus, including cell phones, will need to dial 03220-63655 in order to reach the helpdesk. A Student Helpdesk Support Technician will answer the call during hours. If the user is calling in after hours, they will need to leave a detailed message that includes their name, a phone number where they can be reached, and a brief description of the issue."
      ]
    },
    {
      "intent": "What services does the Help Desk offer?",
      "text": [
        "What services are offered by the Help Desk?",
        "What are the help desk's services?",
        "What are the services offered by the Help Desk?",
        "What services is offered by the Help Desk?",
        "What services are provided by the Help Desk?",
        "What services does the Help Desk offer?"
      ],
      "responses": [
        "Email setup and technical questions, Computer network issues, and account login issues are some of the issues that can be solved by network and configuration support for IT services.",
        "Computer network issues, mail setup and password assistance, and account andlogin issues are some of the technical issues that can be answered by IT service providers.",
        "Computer performance issues, email setup, password issues, and technical questions are just some of the problems that network and IT support staff can assist you with.",
        "Computer network issues, email setup, technical questions, and account problems are some of the issues that support IT services is able to help with.",
        "Support for IT services includes Basic hardware and computer performance issues, and email setup and technical questions.",
        "Network troubleshooting and configuration Support for IT services Basic hardware troubleshooting Computer performance issues Virus scan and malware detection Email setup KNUST password assistance Technical questions Computer network connectivity questions Account/login issues"
      ]
    },
    {
      "intent": "Who is eligible to benefit from the services provided by the Help Desk",
      "text": [
        "The Help Desk can help those who are eligible.",
        "The help desk can offer services to those who are eligible.",
        "The Help Desk can provide services to those who are eligible.",
        "You can get the services provided by the help desk if you are eligible.",
        "There are people who should be able to benefit from services provided by the Help Desk.",
        "Who is eligible to benefit from the services provided by the Help Desk"
      ],
      "responses": [
        "The KNUST Helpdesk is responsible for providing technical support and assistance to students who present a valid student ID, regardless of whether they have a valid student ID or not.",
        "The KNUST team is responsible for providing tech support to all staff and students if they have a valid student ID.",
        "The KNUST Helpdesk is responsible for providing technical support to staff and students who are willing to show valid student ID before the service can be provided.",
        "All Staff and Students who have a valid student ID are required to present a valid student ID in order for technical support and other services to be provided.",
        "Students and staff with valid student identification are required to present their ID before technical support services can be provided.",
        "The KNUST Helpdesk is responsible for providing technical support and troubleshooting services to all Staff and Students who are able to present a valid student ID prior to services being provided."
      ]
    },
    {
      "intent": "Can I access results for past semesters?",
      "text": [
        "Can I see the results of previous semesters?",
        "Is it possible to access results from the past semester?",
        "I have wondered whether I can get the results for the past semester.",
        "I would like to get results for the past semester.",
        "Is it possible to access results from past semesters?",
        "Can I access results for past semesters?"
      ],
      "responses": [
        "Yes.Click the Check Results icon if you want to log in to the students portal.",
        "Yes, that's right.Go to the students portal and look for the Check Results icon.",
        "Yes.Click the Check Results icon if you don't like what you see after logging in to the students portal.",
        "Yes.Click the Check Results icon if you're on the students portal.",
        "Yes, it's true.Click on the Check Results icon if you want to log in to the students portal.",
        "Yes. Go to the students portal, login and click the Check Results icon"
      ]
    },
    {
      "intent": "How do I get my username and password?",
      "text": [
        "I have questions about how to get my password and usernames.",
        "How can I access my account?",
        "How do I get access to my account?",
        "How am I able to gain access to my account?",
        "How do I reset my password?",
        "How do I get my username and password?"
      ],
      "responses": [
        "You will be given a usernames and password when you receive your admission confirmation in the mail.If you get a message in the phone inbox with the sender name 'KNUST' in it, you can enter your student number to get a reset link in your email.You should have a student ID card or an admission letter if you want to visit the UITS support center.",
        "Confirmation of your admission via text is needed to give you a password and your password is Your usernames and passwords are given to you after confirmation of your admission via text.You can reset your email by entering your student number and clicking here, if you don't see a message with the sender ID 'KNUST' you can check your phone's inbox.You can get your student ID card or admission letter to the UITS support center at the basement of the Casely-Hayford building or Prempeh II Library ICT Center.",
        "Your password and usernames are given to you after your admission is confirmed.If you get the message in your phone's inbox with the sender ID 'KNUST', a reset link will be sent to your email.The UITS support center can be found in the basement of the Casely-Hayford Building or the Prempeh II Library ICT Center, if you have your student ID card or admission letter.",
        "Upon receipt of your admission via telephone, your account and password are given to you.Check your phone's inbox for the email with the sender ID, click the link below and you'll get an email with a reset link.You must have an admission letter or student ID to visit the UITS support center in the basement of the Casely-Hayford building.",
        "Upon confirmation of your admissions, your password and usernames are given to you.If you get a message from the sender ID 'KNUST' you need to enter your student number, then a reset link will be sent to your email.You can get an admission letter or student ID card to go to the UITS support center, located in the basement of the Casely-Hayford building or the Prempeh II Library ICT Center.",
        "Your username and password are given to you upon confirmation of your admission via SMS. Check your phone’s SMS inbox for the message with the sender ID ‘KNUST’ Click HERE and enter your student number, a reset link will be sent to your email. ( The email you provided during your admission application). Visit the UITS support center (at the basement of the Casely-Hayford building or Prempeh II Library ICT Center) with your student ID card or admission letter."
      ]
    },
    {
      "intent": "How do I logon to KNUST Students' Portal? What's my username and password?",
      "text": [
        "How do I get into the Students' portal?What is my password?",
        "Is there a way to sign up for the students' portal?What is my password?",
        "What do I do when I want to access the students' portal?I want to know what my password and usernames are.",
        "I don't know how to log in to the students' portal.What is my password?",
        "What do I need to do to log in to the students' portal?I am not sure what my password is, and my usernames is not known.",
        "How do I logon to KNUST Students' Portal? What's my username and password?"
      ],
      "responses": [
        "Students can access their students portal by logging on to their school's website, or by download the KNUST AIM app from the play store.The password and Username that the university gives you is the one you'll have to use to log into your students' portal and other services.",
        "Students can access their student portal through either the app on the app store or the AIM app on the Play Store, the latter is where you'll find the KNUST AIM app.Your password and Username are the credentials you will receive from the university to access your students' portal and other services.",
        "The students' portal can be accessed by logging on to the app, or by using the KNUST AIM app on the play store.The university gave you the password and Username for your students' portal, and other services, in order to make it easier for students to access them.",
        "To access their students' portal, they need to either log on to the website at https://apps.k snt.edu.gh/students/ or download the AIM app from the play store.Your password is the key to your students' portal and other university services, and is given to you by the university.",
        "The students portal can be accessed through the students' account by logging on to the portal or using the AIM app, which can be downloaded from the play store.The university gives you a password and a Username to use when you are a student so you can take advantage of the services the university has to offer.",
        "Students can access their students' portal by logging on to https://apps.knust.edu.gh/students/, or by downloading the KNUST AIM app on google play store. Your Username and password is the credential given to you by the university to have access to your students' portal and other services offered by the university to students."
      ]
    },
    {
      "intent": "How do I Use the KNUST AIM?",
      "text": [
        "What do I need to know to use the KNUST AIM?",
        "How can I use the KNUST AIM?",
        "I don't know how to use the nywayanyday AIM.",
        "How come I can't find out how to use the KNUST AIM?",
        "What do I need to do in order to use the KNUST AIM?",
        "How do I Use the KNUST AIM?"
      ],
      "responses": [
        "There is a short video that you should watch.",
        "This short video has a few things to say.",
        "There is a short video that you can watch.",
        "This is a short video.",
        "This is a short video.",
        "Watch this short video"
      ]
    },
    {
      "intent": "How many times am I supposed to register for courses?",
      "text": [
        "How many times a year do I have to register for courses?",
        "Is there a limit to how many times I need to register for courses?",
        "How many times a year do I have to register for courses?",
        "I don't know how many times I have to register for courses.",
        "How many times a year do I have to register for courses?",
        "How many times am I supposed to register for courses?"
      ],
      "responses": [
        "The courses are registered on semester bases for the School of Medicine and Dentistry.",
        "The only programmes for which course registration is done are in the school of medicine and dentistry.",
        "Only the School of Medicine and Dentistry has semester bases for course registration.",
        "Most course registration is done on semester bases, but there are some programmes in the School of Medicine and Dentistry.",
        "There are programmes in the school of medicine and dentistry, but it is not possible for students to register for them on the semester bases.",
        "Course registration is done on semester bases except for some programmes in the School of Medicine and Dentistry"
      ]
    },
    {
      "intent": "I forgot my password to the KNUST Students' Portal. What do I do?",
      "text": [
        "I had forgotten my password to the students' portal.What should I do?",
        "I didn't know I had forgotten my password to the students' portal.I don't know what to do.",
        "The students' portal is where I forgot my password.I don't know what to do.",
        "I didn't remember my password to the students' portal.What am I supposed to do?",
        "I forgot to enter my password, so I couldn't access the students' portal.What am I supposed to do?",
        "I forgot my password to the KNUST Students' Portal. What do I do?"
      ],
      "responses": [
        "These steps will help you reset your student credentials.You can use the application at https://apps.kNuSt.edu.gh/students.Click here if you forgot your password.A reset link will be sent to your personal email, after you enter your student reference number.Click on \"continue\" and then check your email after a reset link has been sent to \"your mail\".If you check this email you'll be able to complete the process.If you don't see the email in your inbox, you'll need to check your junk mail.To ensure that you receive all messages from the UITS, you'll need to add appsupport@knust.edu.gh and helpdesk@knust.edu.gh to your address book or contacts list.If you can't generate your credentials, then you should visit the UITS support office in the basement of theExams Hall Complex.",
        "You should follow the steps to reset your student credentials.You can go to the app at https://apps.knust.edu.gh.Either click here 3 or click on the forgot password and it would bring you to the forgotten password page.A reset link will be sent to your email address after you enter the student reference number, you'll be notified via email.If you don't find a reply in a few days, click on \"continue\" and check your email.Please check this email if you want to complete the process.Please check your inbox if you don't see the email in your inbox.To ensure that you receive all e-mail messages from UITS, please add the app support@knust.edu.gh and the help desk@knust.edu.gh to your address book or contacts list.If you're not able to get your credentials, you can visit the UITS support office located in the basement of Casely Hayford Building.",
        "You can reset your student credentials by following the steps.You can use the app at http://apps.knust.edu.gh/students.Click here if you forgot your password.The email you'll be notified via will be your personal email address, the reset link will be sent to you, and so on and so forth.Check your email after you click on \"continue\", because a reset link has been sent to \"your mail\".Please check the email to make sure you're done with the process.If you do not get the email in your inbox, you should check your junk mail.If you would like to be sure that you receive all e-mail messages from the UITS, you must include the app support@knust.edu.gh and helpdesk@knust.edu.gh on your address book or contacts list.You can get your credentials at the UITS support office in the basement of Casely Hayford Building.",
        "Follow the following steps if you would like to reset your student credentials.2.You can go to the website at the app.knust.edu.gh.Click HERE if you missed the password? or alternatively, click here if you didn't remember the password at all.If you enter the student reference number, you will get an email notification with a link that will be sent to your personal email.If you want to continue, click on \"continue\", then check your email.If you check this email you'll be finished with the process.Do not check your inbox if there's no email in it.If you want to get all the e-mail messages from UITS, you must add the appsupport@knust.edu.gh and helpdesk@knust.edu.gh to your address book or contacts list.If you are not able to get your credentials, you can visit the UITS support office located in the basement of the Casely Hayford Building.",
        "These steps are necessary to reset your student credentials.Go to the app at the top of the page to see the students.Click on the password you forgot, or click here for the one that's already been used.You will be notified via email, and a reset link will be sent to your email that's been shown to you.Check your email and click on \"continue\" if you don't know what you're supposed to do.If you check this email, you will be able to complete the process.Please check your junk folder if you don't see the email in your inbox.If you want to receive all of the e-mail messages from the UITS, please add appsupport@knust.edu.gh and the helpdesk@knust.edu.gh to your address book or contacts list.If you are not able to get your credentials, then you should visit the UITS support office in the basement of Casely Hayford Building.",
        "To reset your student credentials kindly follow the these steps. 1.Go to https://apps.knust.edu.gh/students 2. Click on forgot password? or click HERE 3. Enter your student reference number, you'll be notified via email, a reset link will be sent to your personal email ( address will be shown to you ) 4. Click on \"continue\" and check your email. ( reset link has been sent to \"your mail\". Please check this email to complete the process).  If you do not see the email in your inbox, kindly check your spam folder. To help ensure that you receive all e-mail messages from the UITS, please add appsupport@knust.edu.gh and helpdesk@knust.edu.gh to your address book or contacts list.)  In the event that you are not able to generate your credentials, please visit the UITS support office at the basement Casely Hayford Building (Exams Hall Complex)."
      ]
    },
    {
      "intent": "I'm trying to register my courses and the system tells me I do not have clearance to register. Why?",
      "text": [
        "I'm trying to register my courses, but the system tells me I don't have permission to do so.Why?",
        "I'm trying to register for my courses but the system tells me I can't do that because I don't have clearance.Why?",
        "I'm attempting to register my courses, but the system says I don't have clearance to do so.Why?",
        "I am attempting to register my courses, but the system tells me I don't have permission to do so.Why?",
        "I am trying to register my courses and I am told I do not have clearance to do so.Why?",
        "I'm trying to register my courses and the system tells me I do not have clearance to register. Why?"
      ],
      "responses": [
        "It is tagged as owing fees because you did not register on time and you did not make full payment of the fees.If you have an issue, please contact the exams officer.",
        "This is due to the fact that you did not register on the due date and that you have not made full payment of fees, which is tagged as owing fees.Contact your exam officer to get your problem solved.",
        "You did not register on time because you didn't make full payment of fees, which is tagged as owing fees, so this could be a number of reasons.Contact your exam officer if you have an issue that you're not sure what to do about.",
        "There could be a number of reasons, the first being you did not register on or before the due date; the second being that you did not make full payment of fees, the third being that you did not register on time or in full; and the fourth being that you did not payIf you have an issue, contact the exams officer.",
        "It could be because you failed to register on time or you did not make fullpayment of fees, which is what is tagged as owing fees.Call your exams officer to have your issue solved.",
        "This could be due to a number of reasons; You have not made full payment of fees, hence, tagged as owing fees You did not register on or before the due date for registration. Contact your exams officer to have your peculiar issue resolved"
      ]
    },
    {
      "intent": "The system is not displaying my grades and/or courses.",
      "text": [
        "The system isn't showing my grades or courses.",
        "My grades or courses are not showing up on the system.",
        "I can't see my grades or courses on the system.",
        "My courses are not showing up in the system.",
        "My grades and courses are not being displayed on the system.",
        "The system is not displaying my grades and/or courses."
      ],
      "responses": [
        "If you don't see your Grades yet in the system or you didn't assess your lecturers for the courses, contact your exams officer.",
        "Your grades haven't been uploaded into the system yet and you haven't assessed your lecturers for the courses, if that's still happening, make sure to report it to your exams officer.",
        "If your Grades aren't uploaded into the system or you aren't assessed for various courses, you need to contact your exams officer.",
        "If your grades haven't been uploaded into the system, or your lecturers haven't assessed you in any of the courses, you should contact your exams officer.",
        "If it persists, contact your exams officer because Grades or the Courses have not yet been uploaded into the system.",
        "Your Grades or Courses have not been uploaded yet into the system or you haven't assessed your lecturers for the various courses .If it persists, contact your exams officer."
      ]
    },
    {
      "intent": "What are the requirements for results checking?",
      "text": [
        "There are requirements for results checking.",
        "What are the requirements for checking on the status of the project?",
        "How are the requirements for results checking?",
        "What are some of the requirements for results checking?",
        "What are the requirements for finding out what happened?",
        "What are the requirements for results checking?"
      ],
      "responses": [
        "In order for the student to have paid feed, he or she should have assessed the Lecturers for the responsible courses taken for that semester.This is done online, and the student shouldn't have a tag on him or her.",
        "Student should have paid feed in full where required, and they should have assessed their lecturer for responsible courses taken during the semester.Students who are done online should not have tags assigned to them.",
        "Student should have paid feed where required, INRDeals INRDeals INRDeals INRDeals INRDeals INRDeals INRDeals INRDeals INRDeals INRDeals INRDeals INRDeals INRDeals INRDeals INRDeals INRDeals INRDeals INRDeals INRDeals INRDeals INRDeals INRDeals INRDeals INRDeals INRDeals INRDeals INRDeals INRDeals INRDeals INRDeals INRDeals INRDeals INRDeals INRDeals INRDeals INRDeals INRDeals INRDeals INRDeals INRDeals INRDeals INRDeals INRDeals INRDeals INRDeals INRDeals INRDeals INRDeals INRDeals INRDealsA student must have no tag assigned to him or her for this to be done online.",
        "Student should have paid feed in full, and they need to assess the Lecturers for responsible courses taken for that semester.If the student has a tag assigned to him or her it should not be done online.",
        "Student should have paid feed in full where necessary and assessed by Lecturers for courses taken for that semester.Students should have no tag assigned to them as this is done online.",
        "Student should have paid feed in full Where required, student should have assessed Lecturers for responsible for courses taken for that semester. This is done online Student should have no tag assigned him or her"
      ]
    },
    {
      "intent": "What can I do on the students’ portal?",
      "text": [
        "I do not know what to do on the students portal.",
        "There is a portal for the students and what can I do there?",
        "What should I do on the students portal?",
        "Can I use the students portal?",
        "What should I do on the students portal?",
        "What can I do on the students’ portal?"
      ],
      "responses": [
        "Personal information can be updated at any time, including the following: Course registration slip printing, semester results, biometric registration status, fees, Assess Lecturers, graduation status, and personal information.",
        "Personal information can be updated with the following: Check the semester results, check the fees, check the graduation status, and check the personal information.",
        "Check student information, including personal information, including course registration slip, semester results, fees, and tutor 888-353-1299 888-353-1299 888-353-1299 888-353-1299 888-353-1299 888-353-1299 888-353-1299 888-353-1299 888-353-1299 888-353-1299 888-353-1299 888-353-1299 888-353-1299 888-353-1299 888-353-1299 888-353-1299 888-353-1299 888-353-1299 888-353-1299 888-353-1299 888-353-1299 888-353-1299 888-353-1299 888-353-1299 888-353-1299 888-353-1299 888-353-1299 888-353-1299 888-353-1299 888-353-1299 888-353-1299 888-353-1299 888-353-1299 888-353-1299 888-353-1299 888-353-1299 888-353-1299 888-353-1299",
        "Check the personal information of those who register for the course, as well as the information on the registration slip, semester results, fee info, and graduation status.",
        "Personal information can be updated as the semester results are checked, fees information is updated, and graduation status information is checked.",
        "Update personal information Course registration Printing of course registration slip Check semester results Check biometric registration status Check fees information Assess Lecturers Check graduation status"
      ]
    },
    {
      "intent": "What else can I access with my student credentials?",
      "text": [
        "Is it possible to access other things with my student credentials?",
        "Is there anything else I can access with my student credentials?",
        "What else do I have access to with my student credentials?",
        "What else can I access with my student credentials?",
        "What other things can I access with my student credentials?",
        "What else can I access with my student credentials?"
      ],
      "responses": [
        "Email services and a virtual class.",
        "Library Services Virtual Class is provided by Email Services Library Services Virtual Class is a class that is provided by email Services Library Services Virtual Class is a class that is provided by email",
        "There are email services and a virtual class.",
        "The email services and library services are offered by the student.",
        "Email services is available through the library service called library services virtual class.",
        "Student Email Services Library Services Virtual Class"
      ]
    },
    {
      "intent": "What is my student reference number?",
      "text": [
        "What's my student reference number?",
        "What is the student reference number?",
        "What's the student reference number?",
        "How do I find my student reference number?",
        "My student reference number is something that I don't know.",
        "What is my student reference number?"
      ],
      "responses": [
        "Your application number is the same as your application number.This is an eight digit number and starts with a second and a third.",
        "It is the same as your application number.The beginning of this number is two and it is an eight digit number.",
        "Your application number is the same as your application number.This is an eight-digit number, for example, 20344345, and starts with two (2).",
        "Your application number is the same as your application number.This starts with two and ends with eight.",
        "Your application number is the same as it is your application number.This is an eight digit number and starts with two.",
        "The same as your application number. This starts with two(2) and is an eight digit number for example 20344345"
      ]
    },
    {
      "intent": "What will happen if I delay in registering my courses?",
      "text": [
        "What will happen if I don't register in time?",
        "What will happen if I don't register in time?",
        "If I wait to register my courses, what will happen?",
        "I am unsure of what will happen if I delay in registering for my courses.",
        "What consequences will I have if I don't register my courses?",
        "What will happen if I delay in registering my courses?"
      ],
      "responses": [
        "You'll pay a fine for every day you don't register.",
        "If you don't register by the end of the day you'll pay a fine.",
        "You will be fined for late registration every day that you haven't done it.",
        "Late registration fines are paid for each day the fines have not been paid.",
        "Each day that passes, you will have to pay a fine for late registration.",
        "For each day that has elapsed, you will pay a fine for late registration."
      ]
    },
    {
      "intent": "When can I check my results?",
      "text": [
        "I wonder when I can check my results.",
        "How can I check my results?",
        "Is there a time when I can check my results?",
        "Can I check my results at a certain time?",
        "I want to know when I'm able to check my results.",
        "When can I check my results?"
      ],
      "responses": [
        "It was approved by the department.",
        "After it has been approved, it will be time for it to be forwarded to the department.",
        "It was approved by the department.",
        "The department gave the green light after it had been approved.",
        "It was approved by the department.",
        "After it has been approved by the department"
      ]
    },
    {
      "intent": "Where can I check my results?",
      "text": [
        "Where can I see my results?",
        "I want to know where I can look at my results.",
        "Where should I go to look at my results?",
        "Where can I see my results?",
        "Is there a place where I can look at my results?",
        "Where can I check my results?"
      ],
      "responses": [
        "Online at the students portal, where there is an app called On the Students AIM.The Office of the Examinations Officer is at the college or department where you work.",
        "On the students AIM application is online on the students portal.The office of your Examinations Officer is the place where you can find information on your exams.",
        "On the Students AIM application can be downloaded from the students portal.The office of your Examinations Officer is at the Department, Faculty or College.",
        "On the Students AIM is an application available for download on the students portal.The exam officer's office is located in the department, faculty or college.",
        "On the Students AIM is available on the students portal.There's an Examinations Officer at the office of the Department, Faculty or College.",
        "Online on the students portal On the Students AIM Android application.  At the office of your Examinations Officer (Departmental, Faculty or College)"
      ]
    },
    {
      "intent": "Call Barred error message, I cannot make or receive calls",
      "text": [
        "I'm unable to make or receive calls because of a Barred error message.",
        "I can not make or receive calls because of a Barred error message.",
        "I can't call because of a Barred error message.",
        "I can't make or receive calls because of a Barred error message.",
        "I am unable to make or receive calls because of a Barred error message.",
        "Call Barred error message, I cannot make or receive calls"
      ],
      "responses": [
        "You can call to speak to a customer service agent.",
        "To talk to a customer service agent, you can call a number from the above 888-666-1846 888-666-1846 888-666-1846 888-666-1846 888-666-1846 888-666-1846 888-666-1846 888-666-1846 888-666-1846 888-666-1846 888-666-1846 888-666-1846 888-666-1846 888-666-1846 888-666-1846 888-666-1846 888-666-1846 888-666-1846 888-666-1846 888-666-1846 888-666-1846 888-666-1846 888-666-1846 888-666-1846 888-666-1846 888-666-1846 888-666-1846 888-666-1846 888-666-1846 888-666-1846 888-666-1846 888-666-1846 888-666-1846 888-666-1846 888-666-1846 888-666-1846 888-666-1846 888-666-1846 888-666-1846 888-666-1846 888-666-1846 888-666-1846",
        "The customer service agent will be able to speak to you.",
        "It's best to speak to the customer service agent.",
        "You can speak to a customer service agent by calling the number that you see on the screen.",
        "Call 0322045888 / 0302982512 to speak to a Vodafone customer service agent."
      ]
    },
    {
      "intent": "I am not receiving text messages from on my School Vodafone number, what should I do?",
      "text": [
        "I'm not getting text messages from my school, what should I do?",
        "What should I do when I don't get any text messages on my school phone number?",
        "What should I do if I don't receive text messages on my school phone number?",
        "I am not receiving text messages, what should I do?",
        "I am receiving text messages on my phone, but what should I do?",
        "I am not receiving text messages from on my School Vodafone number, what should I do?"
      ],
      "responses": [
        "The IT support centre is located in the basement of the Casely Hayford Building and is open to the public.Or call the number on the side of the phone.",
        "You can get an update of your Vodafone number by visiting the IT Support Centre in the basement of the Casely Hayford Building.You can call on the number that's on the other side of the phone.",
        "The IT support centre is located in the basement of the casely hayford building and is open to the public.Or write a letter to the person or thing on the body of the letter.",
        "If you're looking for an update of your telephone number, you can visit the IT Support Centre in the basement of the Casely Hayford Building.You can call on that number.",
        "The IT Support Centre is located in the basement of the Casely Hayford Building.Or if you'd like, you can call on the number above.",
        "Visit the IT Support Centre, located at the basement of Casely Hayford Building for an update of your Vodafone number. Or call on 0322063655."
      ]
    },
    {
      "intent": "I am using the same number with another student, what should I do?",
      "text": [
        "I'm using the same number with another student, I don't know what to do.",
        "What should I do with the number that is being used with another student?",
        "What should I do with my number, I have it with another student.",
        "I am using the same number in class, what should I do?",
        "I use the same number with someone else, what should I do?",
        "I am using the same number with another student, what should I do?"
      ],
      "responses": [
        "There is an IT Support Centre located in the basement of the Casely Hayford Building.You can call on B.",
        "The IT Support Centre is located at the basement of the Casely Hayford Building.B. Or call on the number that pops up in your phone screen.",
        "Go to the IT Support Centre in the basement of Casely Hayford Building to report it.If you want, you can call B.",
        "The IT Support Centre is located in the basement of the Casely Hayford Building.Alternatively, you can call on the above number.",
        "The IT Support Center is located in the basement of the Casely Hayford Building.You can call B or the number on the other end of the line.",
        "A. Visit the IT Support Centre, located at the basement of Casely Hayford Building and report it. B. Or call on 0322063655"
      ]
    },
    {
      "intent": "I do not receive my monthly package, what should I do?",
      "text": [
        "I don't receive my monthly package, what should I do?",
        "I didn't receive my monthly package, what should I do?",
        "I don't have a monthly package, what should I do?",
        "I don't receive my monthly package, what should I do?",
        "I do not get my monthly package, what should I do?",
        "I do not receive my monthly package, what should I do?"
      ],
      "responses": [
        "To get in touch with a customer service agent for Vodafone, please call 322045888 or 302982512The IT Support Centre is located in the basement of the Casely Hayford Building.",
        "To speak to a customer service agent, call the number on the sticker on the back of the phone.The IT Support Centre is located in the basement of the Casely Hayford Building.",
        "Call the customer service agent of your carrier to speak to them.You can report it at the IT Support Centre located in the basement of the Casely Hayford Building.",
        "If you want to speak to the customer service agent, you need to call.The IT Support Centre is located in the basement of the Casely Hayford Building.",
        "To speak to a customer service agent, you must call three times: A., B., and C.You can report it at the IT Support Centre located in the basement of the Casely Hayford Building.",
        "A. Call 0322045888 / 0302982512 to speak to a Vodafone customer service agent. B. Visit the IT Support Centre, located at the basement of Casely Hayford Building and report it."
      ]
    },
    {
      "intent": "I don’t know/remember my Vodafone number, how do I find it?",
      "text": [
        "I don't know what to look for, how to find my phone number?",
        "I don't remember my phone number, how do I find it?",
        "I don't know or remember, how do I locate my phone number?",
        "I have no recollection of my phone number, how do I find it?",
        "I don't know how to find my phone number.",
        "I don’t know/remember my Vodafone number, how do I find it?"
      ],
      "responses": [
        "You can use one of the following options; A.dial * 127# on your mobile device to see your phone number; B.click on the Phone Number section to see the phone number you want to call.",
        "You can dial * 127# to show your phone number, or you can go to the app on your phone and scroll down to the phone number section.",
        "If you've installed the Academic Info Manager, you can scroll down to the phone number section.",
        "To see your phone number, dial *127# on your mobile device and press the profile menu icon.",
        "You can do one of the following things; A. phone number on your mobile phone, B. phone number on your mobile phone, or C. scrolling down to the phone number section.",
        "You can do any of the following;  A. Dial *127# on your mobile handset to show your number  B. If you have installed the Academic Info Manager Android App (AIM); i.Press the profile menu icon.  ii.Scroll down to the Phone number section.  iii.You will find the number under the KNUST Mobile Number  C. You can also visit the KNSUT Student portal (apps.knust.edu.gh) on your internet browser and follow these steps;  i.Click on the ‘Students’ button  ii.Log in with your username and password  iii.On the personal information page that welcomes you, you will find your number under the KNUST Vodafone number field."
      ]
    },
    {
      "intent": "I don’t want the package on my personal number anymore",
      "text": [
        "I do not want the package on my personal number anymore.",
        "I don't want my personal number to hold this package on me in the middle of the night.",
        "I don't want my personal number to hold the package.",
        "The package is on my personal number, and I don't want that anymore.",
        "My personal number is not the place to have a package on.",
        "I don’t want the package on my personal number anymore"
      ],
      "responses": [
        "The manager of the IT Support Centre can be reached at the Examination Hall Complex.You can reach him on his cell phone at 800-361-3020 800-361-3020 800-361-3020.To speak to an agent from Vodafone, you must use the B or call the number at the top of the page.",
        "The IT Support Centre Manager is located at the Examination Hall Complex.You can also call him on the number on the other side of the phone.You can speak to a customer service agent for mobile phone network company Vodaphone.",
        "The IT Support Centre Manager may be able to give you some information about the structure of the Examination Hall Complex.You can reach him on the number he gave you.You can call to speak to a customer service agent from the other side of the world.",
        "You can contact the IT Support Centre Manager at the Examination Hall Complex.You can talk to him on that number.The customer service agent for Vodafone can be reached via B.",
        "The IT Support Center Manager can be contacted at the Examination Hall Complex.You have the option to speak to him on the same phone number.To speak to a customer service agent, you can either call or B.",
        "A. Contact the IT Support Centre Manager at the Examination Hall Complex, Basement. You can also speak to him on 0322063655.  B. Or Call 0322045888 to speak to a Vodafone customer service agent."
      ]
    },
    {
      "intent": "I have lost my Vodafone SIM card, where can I get replacement",
      "text": [
        "I lost my sim card, where are I supposed to go to get a new one?",
        "I don't know how to find a replacement for my sim card.",
        "Where can I get a replacement for my sim card, I lost it?",
        "I lost my phone, where should I look for a new one?",
        "I need a replacement for my sim card, where can I get it?",
        "I have lost my Vodafone SIM card, where can I get replacement"
      ],
      "responses": [
        "The College of Engineering is able to provide a replacement sim card for you.The Vodafone Retail Shop is at the Commercial Area.If you are a continuing student, then you need to have your student ID card with you.If you are a freshman without a student ID, you should bring with you a hard copy of your offer letter.",
        "You may get a replacement from the Retail Shop at the College of Engineering.The Retail Shop at the Commercial Area was called B. or the Vodafone Retail Shop in the name of its location in the Commercial Area.If you are a continuing student, you should take the student ID Card with you for the replacement cost.A hard copy of your offer letter for admission is a must for a freshman without a Student ID card.",
        "The College of Engineering has two places where you can get a replacement sim card: a retail shop and a cafe.The Retail Shop is located in the Commercial Area.You should take your student ID Card with you if you are a continuing student.If you do not have a Student ID card, please bring with you a hard copy of your offer letter.",
        "If you're at the college of engineering you can get a new simcard from either the retail shop or the cafe.There is a retail shop in the commercial area.If you are a continuing student, you must bring your student ID card with you for the replacement cost of Ghc 3.00 C.If you are a freshman without a student ID card, please take a hard copy of your offer letter with you.",
        "You can get a new sim card from either the retail shop or the cafe at the College of Engineering.The Retail Shop is located at the Commercial Area.If you are a continuing student, you should bring with you your student ID Card.If you're a freshman without your student ID, please take a hard copy of your offer letter with you.",
        "A. You can get a replacement SIM card from either the Vodafone Retail Shop (Vodafone Café) at the College of Engineering. B. Or the Vodafone Retail Shop at the Commercial Area. Replacement cost is Ghc 3.00 C.If you are a continuing student, you should go along with your student ID Card. D.If you are a freshman without your Student ID card, kindly go along with a hard copy of your provisional offer letter of admission."
      ]
    },
    {
      "intent": "I have not collected my SIM card, where can I get it.",
      "text": [
        "I don't know where to get my sim card, it has not been collected.",
        "I don't have my card yet, where can I get it?",
        "I don't know where to get my sim card.",
        "I don't have my card yet. Where can I get it?",
        "I don't have an address for where I can get my sim card.",
        "I have not collected my SIM card, where can I get it."
      ],
      "responses": [
        "The IT Support Centre in the basement is where you can collect your sim card during the hours of 8:00am and 5:00pm from Monday to Friday.You should bring with you a hard copy of your offer letter of admission, if you are a freshman.You should carry your student ID Card with you if you are a continuing student.",
        "You can collect your card from the IT Support Centre between the hours of 8:00am and 5:00pm on Monday to Thursday and the hours of 8:00am and 5:00pm on Friday.You should bring with you a hard copy of your offer letter, if you are a freshman.You should have your student ID card with you if you are a continuing student.",
        "You can pick up your SIM card from the IT Support Centre on Mondays to Friday between the hours of 8:00am and 5:00pm.If you're a freshman, you should bring a hard copy of your offer letter with you.You should get a student ID Card if you are a continuing student.",
        "You can pick up your sim card at the IT Support Centre, from Monday to Friday, between the hours of 8:00am and 5:00pm.You should bring along a hard copy of your offer letter if you are a freshman.You should take with you a student ID Card, if you are a continuing student.",
        "Between the hours of 8:00am and 5:00pm, you can pick up your SIM card at the IT Support Centre.A hard copy of the offer letter should be with you if you are a freshman.You should have your student ID card along with you if you are a continuing student.",
        "A. You can collect your SIM card from the IT Support Centre (Examination Hall Complex, Basement) between the hours of 8:00am and 5:00pm, from Monday to Friday. B. If you are a freshman, you should go along with a hard copy of your provisional offer letter of admission. C. If you are a continuing student, you should go along with your student ID Card."
      ]
    },
    {
      "intent": "I have the package but I cannot make calls or use the data bundle",
      "text": [
        "I have the package but it doesn't allow me to use the data bundle or make calls.",
        "I can make calls from the package, but not from the data bundle.",
        "I have the package, but I cannot make calls or use the data bundle.",
        "I can use the data bundle, but I am unable to make calls.",
        "I cannot make calls or use the data bundle, even though I have the package.",
        "I have the package but I cannot make calls or use the data bundle"
      ],
      "responses": [
        "The IT Support Centre Manager can be reached at the Examination Hall Complex.You can talk to him on that number.You can reach a customer service agent with the B. option.",
        "There is an IT Support Centre Manager in the Examination Hall Complex.You can speak with him on the number that is on the top of this page.If you want to speak to the customer service agent ofVodafone, you'll have to call a toll-free number.",
        "There is an IT Support Centre Manager at the Examination Hall Complex.You can talk to him on the same number.If you want to talk to a customer service agent about Vodafone, you have two options: B. or Call.",
        "The IT Support Centre Manager can be reached at the Examination Hall Complex.You can talk to him on that number.If you prefer you can call the phone number for a customer service agent.",
        "The IT Support Centre Manager can be reached at the Examination Hall Complex.You can talk to him on that number.Call to speak to a customer service agent for the company you're talking to.",
        "A. Contact the IT Support Centre Manager at the Examination Hall Complex, Basement. You can also speak to him on 0322063655 . B. Or Call 0322045888 to speak to a Vodafone customer service agent"
      ]
    },
    {
      "intent": "I want to transfer the package onto my personal Vodafone number",
      "text": [
        "I'm going to transfer the package to my personal phone number.",
        "I would like to transfer the package to my own phone number.",
        "I want to assign my number to the package.",
        "I would like to transfer the package to my own phone number.",
        "I want to use my personal number to transfer the package.",
        "I want to transfer the package onto my personal Vodafone number"
      ],
      "responses": [
        "Please indicate why to visit the IT Support Centre in the basement of the Casely Hayford Building.You can call B or the other way around.",
        "The IT Support Centre is located in the basement of the Casely Hayford Building.Call on the number that's written B., or you can call on a different number.",
        "It Support Centre is located in the basement of the Casely Hayford Building.Call on the number found on the left side of the screen.",
        "If you want to know why, go to the IT Support Centre located in the basement of the Casely Hayford Building.Or write to B., or call on the number that's on the back of the phone.",
        "You can find the IT Support Centre in the basement of the Casely Hayford Building.Or call toll free at the following numbers: B. or call toll-free at the following numbers:",
        "A. Visit the IT Support Centre, located at the basement of Casely Hayford Building and indicate why. B. Or call on 0322063655."
      ]
    },
    {
      "intent": "My network shows emergency calls only",
      "text": [
        "Emergency calls aren't shown on my network.",
        "Emergency calls are only shown on my network.",
        "Emergency calls are only shown on my network.",
        "Emergency calls are shown only on my network.",
        "Emergency calls are shown only on my network.",
        "My network shows emergency calls only"
      ],
      "responses": [
        "There is a IT Support Centre Manager at the Examination Hall Complex.You can talk to him at the same time on the same number.If you want to speak to a customer service agent, you can either call or B.",
        "The IT Support Centre Manager can be contacted at the Examination Hall Complex.You can also reach him on the number on the side of the building.To speak with a customer service agent, please call the number specified in B. or Call the number that is on the back of the phone.",
        "You can reach the IT Support Centre Manager at the Examination Hall Complex.You can talk to him on the same phone number.If you want to speak to the customer service agent, you can call B.",
        "The IT Support Centre Manager can be reached at the Examination Hall Complex.You can also get in touch with him on that number.Call or click to speak to the customer service agent of your choice.",
        "The IT Support Centre Manager can be contacted at the Examination Hall Complex.You can talk to him on the number he gave you.Call the customer service agent at Vodafone and ask them to speak to B.",
        "A. Contact the IT Support Centre Manager at the Examination Hall Complex, Basement. You can also speak to him on 0322063655.  B. Or Call 0322045888 to speak to a Vodafone customer service agent."
      ]
    },
    {
      "intent": "Can I pay my fees via mobile money?",
      "text": [
        "Is it possible to pay my fees with mobile money?",
        "Is it possible for me to pay my fees via mobile money?",
        "I am wondering if I can pay my fees with mobile money.",
        "Is it possible to pay my fees via mobile money?",
        "Is it possible to pay my fees with mobile money?",
        "Can I pay my fees via mobile money?"
      ],
      "responses": [
        "Click here if you want to make a payment on a mobile money platform.",
        "Yes, you can make payments on mobile money platforms.",
        "Please click the button to make a payment using a mobile money platform.",
        "You must click here to make payments via mobile money platforms.",
        "If you click here you will be directed to make payments via mobile money platforms.",
        "Yes, Please Click here to make payments via mobile money platforms."
      ]
    },
    {
      "intent": "How do I make payment via debit / credit card",
      "text": [
        "How do I use a credit/Debit card to make a payment?",
        "Payments can be made with a credit card or a debit card.",
        "I need to make a payment with a credit or debit card.",
        "How can I pay with a credit or debit card?",
        "How do I pay for things with my credit card or debit card?",
        "How do I make payment via debit / credit card"
      ],
      "responses": [
        "It's possible to make payments via mobile money platforms.",
        "You can make payments via mobile money platforms.",
        "You can make payments via mobile money platforms.",
        "Please use the mobile money platforms to make payments.",
        "Click here if you would like to make a payment via mobile money platforms.",
        "Yes, Please Click here to make payments via mobile money platforms."
      ]
    },
    {
      "intent": "Which financial institutions have been accredited for fee payment?",
      "text": [
        "Which financial institutions have been accredited by the government to accept fee payments?",
        "Which financial institutions have been approved for the payment of fees?",
        "Which financial institutions have been approved to accept fee payments?",
        "Which institutions were accredited to accept fee payments?",
        "Which financial institution has been accredited for fee payment?",
        "Which financial institutions have been accredited for fee payment?"
      ],
      "responses": [
        "Universal Merchant Bank, Ecobank Fidelity bank, GCB Unibank, and UBA Access bank are all subsidiaries of Ecobank.",
        "Ecobank Fidelity bank HfC and Universal Merchant bank are both owned by GCB Unibank.",
        "Universal Merchant bank, Ecobank Fidelity bank, GCB Unibank, and UBA Access bank are all owned by Ecobank.",
        "Universal Merchant Bank, Ecobank Fidelity, GCB Unibank, UBA Access Bank, and Fidelity bank are some of the banks which are part of Ecobank.",
        "Universal Merchant Bank is owned by Ecobank Fidelity bank and GCB Unibank.",
        "Ecobank Fidelity bank HfC bank Universal Merchant Bank UBA Access Bank GCB Unibank"
      ]
    },
    {
      "intent": "How can I correct a mistake in the courses I registered?",
      "text": [
        "I need to know how to correct the mistake in the courses I registered for.",
        "How can I correct a mistake that I've made?",
        "I registered for some courses that I am sure I've made a mistake in.",
        "How can I correct a mistake that I've made in the courses I've registered?",
        "I registered for courses and there is a mistake I want to correct.",
        "How can I correct a mistake in the courses I registered?"
      ],
      "responses": [
        "If you want to re- register, you have to log on to the new app, which you can download on the Playstore or app store.",
        "The registration window is still open so you can log onto the app or use the Aim app if you're interested in re-registering.",
        "You can re-register, if the registration window is open, by using the KNUST Aim app, on the play store, or on the app store.",
        "You can re-register by logging into the app on the website, or you can download the Aim app and do so as long as the registration window is still open.",
        "If the registration window is still open, you can log on to http://apps.Knust.edu.gh/students/Account/login and re- register by using the KNUST Aim app.",
        "Log on to http://apps.knust.edu.gh/students/Account/login or use the KNUST Aim app(download on playstore or appstore) and re-register so long as the registration window is still open."
      ]
    },
    {
      "intent": "How can I know my fee balance?",
      "text": [
        "I don't know how I can find out my fee balance.",
        "How do I know my fee balance?",
        "How can I know if my fee goes up or down?",
        "How can I find out my fee balance?",
        "How can I know if I've paid my fee on time?",
        "How can I know my fee balance?"
      ],
      "responses": [
        "The student portal has an option to use the fee icon, or the KNUST aim is to use the fee icon and go to transactions.You can request your balance at the college finance office.",
        "The students portal has a fee icon and you can use it to go to transactions.At the college finance office, give a request for your balance.",
        "Clicking the fees icon on the dashboard will allow you to make transactions or Knut Aim is to click the fee icon and go to transactions.You can ask for your balance at your college finance office.",
        "The fee icon can be used on the students portal to go to transactions.Your college finance office will be able to give you a request for your balance.",
        "Go to transactions by using the fee icon on the Students portal, or alternatively by using the KNUST Aim: Use the fee icon and go to transactions.You can request a balance at the college finance office.",
        "Students portal: Click the fee icon on dashboard and click transactions OR KNUST Aim: Use the fee icon and go to transactions. Request your balance at your college finance office."
      ]
    },
    {
      "intent": "I haven’t paid my fees in full. What do I do?",
      "text": [
        "I have yet to pay my fees in full.What am I supposed to do?",
        "I have yet to pay my fees in full.I have no idea what to do.",
        "My fees have not been paid in full.I have no idea what I'm supposed to do.",
        "I didn't pay my fees in full.I don't know what to do.",
        "I have not paid my fees in full.What am I supposed to do?",
        "I haven’t paid my fees in full. What do I do?"
      ],
      "responses": [
        "Students can get top up fees at any of the accreditedfinancial institutions nationwide or pay online at https://pay.knust.edu.gh/student and need to make a report to the school in order to get clearance from the Main FInance Officer.",
        "If you want to top up your fees, you can do it by using mobile money or a visa, but you have to get clearance from the Main FInance Officer.",
        "To pay top up fees at any of the accredited financial institutions in the country, you need to use mobile money or anywayanyday to pay, and you need to submit a report to the school to get clearance from the main fInance officer.",
        "If you want to top up your fees at any of the accredited financial institutions, pay online at https://pay.knust.edu.gh/student, or you can submit a report to the school and get clearance from the Main FInance Officer.",
        "The student can pay for top up their fees by either using mobile money or visa, or submit a report to the school, which they can get a clearance for from the Main FInance Officer.",
        "Top up fees at any of the accredited financial institutions nationwide OR Pay online at https://pay.knust.edu.gh/student either by mobile money, visa, mastercard or ghlink OR Report to the school and seek clearance from the Main FInance Officer."
      ]
    },
    {
      "intent": "Is a PhD Student supposed to register courses?",
      "text": [
        "Is a PhD Student required to register courses?",
        "I wonder if a PhD student is supposed to register courses.",
        "Is a PhD student required to register courses?",
        "Is a PhD student required to register courses?",
        "There is a question about whether or not a PhD Student is supposed to register courses.",
        "Is a PhD Student supposed to register courses?"
      ],
      "responses": [
        "Do not hesitate to contact the Department Examination Officer or the programme co-ordinator if you have any questions.",
        "You can contact the Examinations Officer or the Programmes co-ordinator to find out what your response will be.",
        "If you don't get a response from your Department Examinations Officer or Programme Coordinator, you may want to contact them.",
        "If you don't hear a reply from your Department Examination Officer or Programme Administrator, please contact them.",
        "Call your department Examinations Officer if you don't hear back in a few days.",
        "Contact your Department Examinations Officer or Programme Coordinator for a befitting response."
      ]
    },
    {
      "intent": "Is course registration and biometric registration related?",
      "text": [
        "Is the course registration related to the registration of fingerprints?",
        "Is course registration related to other forms of registration?",
        "Is it related to course registration?",
        "Is it related to course registration?",
        "Is it related to course registration?",
        "Is course registration and biometric registration related?"
      ],
      "responses": [
        "Yes, that's right.You will need to register by fingerprints as a requirement of course registration for the semester.",
        "Yes, it's true.You must be registered electronically in order to register for the semester.",
        "Yes, that's right.It is a requirement to register in order to register for class for the semester.",
        "Yes, that's right.You will need to register using your fingerprints as part of the course registration for the semester.",
        "Yes, I'm sure that's true.You have to be registered using a personal identification number if you wish to enroll in a class for the semester.",
        "Yes. You will have to be registered biometrically as a requirement to course registration for the semester."
      ]
    },
    {
      "intent": "Is it compulsory for every student to undergo biometric registration?",
      "text": [
        "Is it required for every student to register?",
        "Is it compulsory for every student to have a photo taken?",
        "Is it a requirement for all students to have a biometrics registration?",
        "Is it compulsory for every student to register?",
        "Is it compulsory for all students to register with the authority that they are a student?",
        "Is it compulsory for every student to undergo biometric registration?"
      ],
      "responses": [
        "Yes.Except for programs that have been given waivers.",
        "Yes, that's right.There are some programmes that have been given waivers.",
        "Yes.Except for the programmes that have been given waivers.",
        "That's right, yes.Waivers have been given to some programmes.",
        "Yes.There are only certain programmes who have been given waivers.",
        "Yes. Except for certain programmes who have been given waivers"
      ]
    },
    {
      "intent": "My courses have not been set up. What do I do?",
      "text": [
        "There are no courses set up for me.What are I supposed to do?",
        "My courses have yet to be set up.I don't know what to do.",
        "I haven't set up my courses.I don't have any idea what to do.",
        "The courses that I'm about to enroll in haven't been set up.I don't know what to do.",
        "My courses have yet to be set up, that's for sure.I don't know what to do.",
        "My courses have not been set up. What do I do?"
      ],
      "responses": [
        "Contact the officer or department to see if they want to work with you.",
        "Ask your examination officer or department to let you know they have something to do with it.",
        "Contact your examinations officer or department to find out more about your exams.",
        "Contact the examinations officer if you're wanting to do an exam.",
        "The officer or department you are talking to should be able to answer your questions.",
        "Contact your examinations officer or department."
      ]
    },
    {
      "intent": "What is the importance of biometric registration?",
      "text": [
        "What is it that makes the registration of a person using irises so important?",
        "The importance of the registration with fingerprints is something that I don't have a clue as to what it is.",
        "What is the significance of a person's name being used in a certain way?",
        "What is the significance of the registration with a Finger Print?",
        "What's the significance of registration using a device that can be used for both fingerprints and irises?",
        "What is the importance of biometric registration?"
      ],
      "responses": [
        "The University makes a decision about the physical presence of a student in school.Students on external research only have toTrademarkiaTrademarkiaTrademarkiaTrademarkiaTrademarkiaTrademarkiaTrademarkiaTrademarkia is required for all students except those on external research",
        "It is the University's method of determining where a student goes to school.All students are required to do this except those doing external research.",
        "The University uses its mechanism to determine the presence of a student in school.Students on external research are required toTrademarkiaTrademarkiaTrademarkiaTrademarkiaTrademarkia is required of all students except those on external research",
        "The University decides on the student's physical presence in school.This is necessary for students only when they are on external research.",
        "It is the University's way of determining the physical presence of a student.Students are required to do this except on external research, the only exception to this requirement is those on external research.",
        "It is the University’s mechanism of determining the physical presence of a student in school. This is required of all students except those on external research."
      ]
    },
    {
      "intent": "What will happen if I fail to register on time?",
      "text": [
        "I don't know if I will have a problem if I don't register on time.",
        "What will happen if I don't register on time?",
        "If I don't register on time, what will happen?",
        "If I don't register on time, what will happen?",
        "If I don't register on time, what will happen?",
        "What will happen if I fail to register on time?"
      ],
      "responses": [
        "The official registration period lasts for one week, but if you fail to register on time you will be fined for three additional days.The affected student won't be registered for that academic year if the process isn't completed within this period.To learn more about university rules relating to registration, click here.",
        "There is a three (3) day longer period after the official registration period to register if you fail to do so on time.If the process is not finished within this period the student will not be registered for that academic year.You can get more information on the university's rules by using the KNUST Student guide.",
        "Penalties for failure to register on time can be as much as three (3) additional days after the official registration period.Students who are not registered for that academic year because of the process not being finished within this period will have no choice but to sit out that academic year.You can download the Student guide for more information on the rules of registration at the university.",
        "There will be a three day penalty if you fail to register on time.If the process is not completed in time, a student will not be registered for that academic year.You can download the student guide to learn more about university rules.",
        "There is a three-day penalty for failing to register on time.When the process isn't finished in the allotted time, the student won't be registered for that academic year.You can get more information on university rules if you take the KNUST Student guide.",
        "Failure to register on time results in a penalty for three(3) additional days after the official  registration period.  When the process is not completed within this period, the affected student shall not be registered for that academic year. For more information on university rules concerning registration,  click here to download the KNUST Student guide."
      ]
    },
    {
      "intent": "Where can I register biometrically after the general window is closed?",
      "text": [
        "Where can I register after the general window closes?",
        "There's a question about where you can register after the general window is closed.",
        "Where can I register for my fingerprints after the general window closes?",
        "Where can I register using my fingerprints when the general window is not open?",
        "Where can I register when the general window is not open?",
        "Where can I register biometrically after the general window is closed?"
      ],
      "responses": [
        "You could contact the UITS, located on the top Floor of the Casely-Hayford building.",
        "You can get assistance at the UITS on the top floor of the Casely-Hayford building.",
        "The UITS can be reached at the top floor of the Casely-Hayford building.",
        "The UITS can be contacted on the top floor of the Casely-Hayford building.",
        "The UITS can be contacted on the top floor of the Casely-Hayford building.",
        "Contact the UITS(at the top floor of the Casely-Hayford building) for assistance"
      ]
    },
    {
      "intent": "Which student is eligible to register courses?",
      "text": [
        "Which student can register for courses?",
        "Which student can register for courses?",
        "Who is eligible to register for courses?",
        "Which student can register for courses?",
        "Which students are eligible to register for courses?",
        "Which student is eligible to register courses?"
      ],
      "responses": [
        "Students who have fulfilled their financial obligation are studying in the program they have fulfilled their financial obligation to in the course of their studies.The finance officer cleared the students because of their arrears.",
        "The students fulfilled their financial obligation in order to get into their programme.Some students who have been cleared by the finance officer have arrears that have not been paid.",
        "The students who have fulfilled their financial obligation for their program are the ones who have done so.The students who have been cleared by the finance officer are those who have not paid their teachers' salaries for more than a year.",
        "Students who have fulfilled their financial obligation are in a position to study their programme.The finance officer clears students who have arrears because they are cleared by the finance officer.",
        "Students who have fulfilled their financial obligation towards the study of their programme.The students were cleared by the finance officer because they did not have enough money to pay their bills.",
        "Students who have fulfilled their financial obligation towards the study of their programme.  Students who have been duly cleared by the finance officer because they have arrears to settle."
      ]
    },
    {
      "intent": "Who can register courses?",
      "text": [
        "Who are you able to register courses?",
        "Who can enroll in courses?",
        "Who can enroll in courses?",
        "Who are the people who can register courses?",
        "Who are the people who are able to register courses?",
        "Who can register courses?"
      ],
      "responses": [
        "They have to tag the students that paid their fees in full.",
        "The students have paid their fees, but there are tags on them.",
        "Students who have paid their fees in full will have to put them on a tag.",
        "Students have to tags because they paid their fees in full.",
        "Students have to tag them when they pay their fees in full.",
        "Students who have paid their fees in full and have to tags."
      ]
    },
    {
      "intent": "I have lost My ID Card, what do I do?",
      "text": [
        "I lost my ID card and what do I do?",
        "What are I supposed to do after I lost my ID card?",
        "I have lost my ID Card, what am I going to do?",
        "I've lost my ID card, what do I do?",
        "I lost my ID card, what should I do?",
        "I have lost My ID Card, what do I do?"
      ],
      "responses": [
        "Next to the Main Administration, there is a Quality Assurance and Planning Unit that you can visit to get assistance in replacing your ID Card.",
        "The Quality Assurance and Planning Unit is next to the Main Administration and is where you will get assistance with replacing your ID Card.",
        "Next to the Main Administration is the Quality Assurance and Planning Unit which is where you can get assistance in getting a new ID Card.",
        "Next to the Main Administration is the Quality Assurance and Planning Unit, which can be used to replace your ID Card.",
        "You can get help in replacing your ID Card from the Quality Assurance and Planning Unit.",
        "Visit the Quality Assurance and Planning Unit, Located next to the Main Administration for assistance in replacing your ID Card."
      ]
    },
    {
      "intent": "Is my student ID card still valid after school?",
      "text": [
        "Does my student ID card still work after school?",
        "Does my student identification card still work after school?",
        "I would like to know if my student ID card is valid after school.",
        "Is the ID card still valid after school?",
        "Does the student ID card still work after school?",
        "Is my student ID card still valid after school?"
      ],
      "responses": [
        "Valid as an identification card and as a financial transaction card, but not as an access control card.",
        "Not valid for accessing library services as a financial transaction card is valid as an identification card.",
        "Not valid for accessing library services, and as a financial transaction card that is valid for identification, but not as an access control card.",
        "Valid as an identification card for financial transactions and not as an access control card for accessing library services.",
        "Valid for identification, not an access control card, not valid for accessing library services, not valid as a financial transaction card, not valid as an access control card, not Valid as an ID card, not valid as an access controlcard, not Valid as a financial transaction card, not valid",
        "Valid as an identification card Valid as a financial transaction card Not valid as an access control card Not valid for accessing library services"
      ]
    },
    {
      "intent": "What do I use the student ID card for?",
      "text": [
        "What do I use my student ID card for?",
        "What is the purpose of the student ID card?",
        "What should I use my student ID card for?",
        "I don't know what I use the student ID card for.",
        "What are the things I use the student ID card for?",
        "What do I use the student ID card for?"
      ],
      "responses": [
        "Identification Access Control Financial Card is a credit card and a master card.Borrowing books, copying and Print are services offered by the library.",
        "The financial card was called Identification Access Control.Borrowing and copying of books are included in library services.",
        "Identification Access Control is a card that is used to pay for things.The Library Services include copying and Print, as well as Borrowing of books.",
        "The Identification Access Control Financial Card is used to pay for goods and services.Borrowing and copy of books are services provided by the library.",
        "The Identification Access Control Financial Card has a certain amount of money on it.Borrowing of books is one of the library services.",
        "Identification Access Control Financial Card (Master Card, Debit, Credit).  Library Services - Copy and Print, Borrowing of books"
      ]
    },
    {
      "intent": "I don't have a university email address. How can I get one?",
      "text": [
        "I don't own a university email address.I can't figure out how to get one.",
        "I do not have a university email address.What do I need to do to get one?",
        "I do not have an email address at the university.I don't know how I will be able to get one.",
        "There is an email address for the university, but I don't have it.How am I going to get one?",
        "I do not have a university email address.I don't know how I'll be able to get one.",
        "I don't have a university email address. How can I get one?"
      ],
      "responses": [
        "The email addresses given to members of the staff are valid.Provide your staff ID card to the following channels, and we'll give you an email address.They said that the first thing that happened was 1.Your college has an IT administrator.The UITS Directorate is located on the last floor of the Casely-Hayford building.",
        "valid members of staff can be given the KNUST email addresses.You need to give your staff ID card to any of the channels to get an email address.There are many things that can be described as 1.The IT Administrator at your college.The UITS complex is on the last floor of the Casely-Hayford building.",
        "valid members of staff have email addresses of their own.You can obtain an email address with your staff ID card, which you must provide at any of the following channels.1. 1, 2, 3, 4, 5, 6, 7, 8, 9,10,11,12,13,14,15,16,17,17,18,17,17,19,18,19,18,19,19,18,19,20,21,21,22,The IT administrator of your college.The UITS division is on the last floor of the Casely-Hayford building.",
        "The email addresses of valid staff members are given on a first-come, first-served basis.You need to provide your staff ID card in the following channels to get an email address.1.The IT administrator of your college.The UITS directorate is located on the last floor of the Casely-Hayford building.",
        "valid members of staff can receive email addresses from KNUST.If you want an email address, you have to give your staff ID card.1.The IT Administrator of your college.The last floor of Casely-Hayford building is where the UITS Directorate is located.",
        "KNUST email addresses are given to valid members of staff. Provide your staff ID card at any of the following channels to obtain an email address. 1. Your College IT Administrator 2. The UITS Directorate (last floor, examination complex, Casely-Hayford building)"
      ]
    },
    {
      "intent": "How do I upload an Assignment",
      "text": [
        "How do I make it appear as if it's my assignment?",
        "Is it possible to upload an assignment?",
        "How do I make a copy of my assignment?",
        "How do I submit an assignment?",
        "I don't know what to do with my assignment.",
        "How do I upload an Assignment"
      ],
      "responses": [
        "Please watch this video if you need help with uploading assignments.",
        "This video is a good place to start when uploading assignments.",
        "Please watch the video on how to make sure your assignments are uploaded.",
        "You can watch the video if you want to know how to upload assignments.",
        "There is a video on how to upload assignments.",
        "Please watch this video on how to upload assignments"
      ]
    },
    {
      "intent": "I’ve forgotten my user credentials, what do I do?",
      "text": [
        "What do I do now that I have forgotten my user credentials?",
        "I forgot my credentials, what do I do?",
        "I have forgotten my credentials, what do I do?",
        "I have forgotten my user credentials, what do I do?",
        "I have forgotten my user credentials, what do I do?",
        "I’ve forgotten my user credentials, what do I do?"
      ],
      "responses": [
        "Follow the procedure to recover your credentials after you click on a forgotten password on http://app.knust.edu.gh/students.Follow the procedure to retrieve your credentials if you click here.",
        "You can get your credentials by following the procedure to get the forgotten password and visiting the app at http://apps.knust.edu.gh/students.You can follow the procedure to retrieve your credentials, if you click here: http://app.knust.edu.gh/students/ Account/ForgotPassword.",
        "You have to click on forgotten password and follow the procedure to get your credentials, which can be found at http://apps.knust.edu.gh/students.Follow the procedure to retrieve the password, if you chose to click here: http://apps.knust.edu.gh/students/Account/ForgotPassword.",
        "Click on forgotten password if you don't remember it and follow the procedure to get your credentials.You can retrieve your credentials by following the procedure at http://apps.knust.edu.gh/students/Account/ForgotPassword.",
        "To retrieve your credentials, go toapps.knust.edu.gh, click on forgotten password, and follow the procedure.If you need to retrieve your credentials, you need to click here: http://app.knust.edu.gh/students/account/retrieve-your-credentials.",
        "Visit http://apps.knust.edu.gh/students  Click on forgotten password and follow the procedure to retrieve your credentials.  Or click here: http://apps.knust.edu.gh/students/Account/ForgotPassword and follow the procedure to retrieve your credentials."
      ]
    },
    {
      "intent": "What do I do when I get user account is not available on this site when I try to access Vclass?",
      "text": [
        "I have a user account on the site but it doesn't appear to be usable when I try to access it.",
        "When I get a user account but it's not available on this site, what do I do?",
        "What do I do if I can't access Vclass because my account isn't on this site?",
        "When I try to access Vclass, the user account isn't available on the site, what do I do?",
        "When I try to access Vclass but my user account is not on the site, what do I do?",
        "What do I do when I get user account is not available on this site when I try to access Vclass?"
      ],
      "responses": [
        "You need to include your student number in your ticket.Or a combination of the two.There is a support centre in the basement of the caseley hayford building.",
        "You need to create a ticket and include your student number.There are either two or one or both of them.There is a support center located in the basement of the CASELEY HAYFORD building.",
        "To add your student number to the ticket, you'd have to create a ticket.Or 2.The SUPPORT CENTRE is in the basement of the Caseley Hayford Building.",
        "You have to include your student number on the ticket in order to get it.Or 2.The support centre is in the basement of the CASELEY HAYFORD building.",
        "Attach your student number with the ticket and you're good to go.Or 2.There is a support centre in the basement of the caseley hayford building.",
        "1.Create a ticket and include your student number (20******).  OR 2. Visit the SUPPORT CENTRE at the basement of the CASELEY HAYFORD BUILDING."
      ]
    },
    {
      "intent": "What do I do when I get invalid login when I try to access Vclass?",
      "text": [
        "What should I do when I can't access Vclass?",
        "When I try to access Vclass, I get invalid login, what do I do?",
        "When I try to access V class, I get invalid login, what do I do?",
        "When I tried to access Vclass, I got an invalid login, what do I do?",
        "What should I do when I don't have the right password to access Vclass?",
        "What do I do when I get invalid login when I try to access Vclass?"
      ],
      "responses": [
        "If you misplace your student credentials, please remember to reset your password and log in again.",
        "If you need to reset the studentcredential password, please log in again.",
        "Resetting your student credential password will allow you to log in again.",
        "You need to reset your student credentials and log in again.",
        "It is recommended that you reset your student credential password before you try to log in again.",
        "Kindly reset your student credential password and log in again."
      ]
    },
    {
      "intent": "• How do I connect to Virtual Classroom?",
      "text": [
        "How do I get in to virtual classroom?",
        "What do I need to do to connect to Virtual Classroom?",
        "Is it possible to connect to Virtual Classroom?",
        "What should I do to connect to Virtual Classroom?",
        "How do I enroll in Virtual Classroom?",
        "• How do I connect to Virtual Classroom?"
      ],
      "responses": [
        "Log in with your KNUST credentials at myclass.knust.edu.gh.",
        "You must have your KNUST credentials to log in at myclass.knust.edu.gh.",
        "Log in with your KNUST credentials when you visit http://Myclass.knust.edu.gh.",
        "Log in with your KNUST credentials at http://myclass.knust.edu.gh.",
        "Log in with your KNUST credentials by visiting http://myclass.knust.edu.gh.",
        "Visit http://myclass.knust.edu.gh/ and log in with your KNUST credentials"
      ]
    },
    {
      "intent": "How do I connect my Android device to the wireless internet?",
      "text": [
        "How can I get my mobile device connected to the internet?",
        "How do I connect my device to the internet?",
        "How do I get my device to work on the internet?",
        "How do I get my device to connect to the internet?",
        "What should I do to connect my device to the internet?",
        "How do I connect my Android device to the wireless internet?"
      ],
      "responses": [
        "If you want to connect to the internet on your AndriOD device, you need to go to the settings on the device.Click on the device you wish to use to make it easier to set it up in a way that works for you.The Advanced options are included in the third step.You should click on the options to make sure you see the one that is right for you.Some phones don't have the settings in the advanced options, so they should be left as they are.When you click on the KNUST you'll see the method for EAP and phase 2 authentication on the screen.The space under identity and password is where you're going to enter your usernames and passwords.There's a chance you can leave blank, but if you want an anonymous identity, you can put your first name there.Your device is going to need to be connected.If your connect button seems to be inactive in the same location for step 4 under the CA certificate, make sure to select \"do not validation\" in order for the connect button to become active.",
        "Go to the settings on your device and choose the connection you'd like to use.To set up your device for use, click on the button in the second step.Step 3 is to select the advanced options.You should look at the options to setup the EAP method, as well as Phase 2Authentication and PAP.Some devices don't have the configuration settings in advanced options, so they should be left as they are.Clicking on the KNUST WIFI will take you to a page with the EAP and phase 2 authentication methods for such devices.The space under identity and password is where you'll enter your usernames and passwords.If you wish to be anonymous, make sure the credentials are properly inputed and connected, otherwise you can put your first name there.The device needs to be connected.If your connect button appears inactive in the same location for step 4 and you choose \"do not validation\", you will not be able to use it.",
        "Go to Settings on your device and select the mode you want to use.The device you choose to use should be configured by click on the button at the end of the second step.The Advanced options are included in the 3rd step.You can choose to use the PAP or the TTLS option under the EAP method.Some phones do not have the configuration settings in advanced options.Immediately you have to click on the KNUST to find the EAP method and phase 2 authentication for such devices.The space under identity and password is where you should enter your usernames and passwords.If you want to be anonymous, you can either put your first name there or leave blank.You should be able to see the connection of your device.In rare cases, if you use the same location for step 4 (a and b) as for step 1 (c), the connect button will become active.",
        "The first thing to do is go to settings on your device and choose the connection you wish to use.The second step is to set up your device for use.There are two options to consider, the Advanced option and the Basic option.There are many options to configured such as the EAP method, under it's section you should see the options to choose from.There are some phones that don't have the configuration settings in advanced options.The EAP method and phase 2 authentication can be found if you click on the link.The space under identity and password is where you can enter your usernames and passwords.If you want to give yourself an anonymous identity, you can put your first name there or leave blank.Your device should be connected to the internet.If the connect button seems inactive in the same location for step 4 (a and b) under the CA certificate, you need to make sure you select \"do not verify\" to get the connect button active.",
        "You can go to settings on your device and choose the connection that you wish to use.Click on the device you wish to use and then set it for use in steps 2 and 3.Advanced options should be chosen in the 3rd step.You should know what the options are to configuration such as the EAP method.Some mobile phones have configuration settings in advanced options that are not always in line with the rest of the device's settings.You can find the EAP method and phase 2Authentication on the WIFI section of the website.Enter your usernames and passwords in the space provided under identity and password.If you want to create an anonymous identity, you can either put your name there or leave blank.Your device has to be connected to the internet.If you choose \"do not confirm\", your connect button will become active, even if it appears to be inactive in the same location as step 4.",
        "STEP 1: Go to Settings on your Andriod device and select WIFI or WIFI Connection.  STEP 2: Click on the KNUST WIFI to configure your device for use.  STEP 3: Select Advanced options. You should see the options to configure such as EAP method etc.  STEP 4: Under EAP Method > choose TTLS, Under Phase 2 authentication > choose PAP. Every other setting should be left as they are.  (b) Some selected android phones do not have the configuration settings in advanced options. For such devices, the EAP method and phase 2 authentication can be found immediately you click on the KNUST WIFI.  STEP 5: Now enter your username and password in the space provided under identity and password respectively. Note, for anonymous identity, you can put your first name there or leave blank  STEP 6: Ensure the credentials are properly inputed and connect. Your device should be connected.  Note: For rare cases where the connect button seems to be inactive, in the same location for step 4 (a and b), under CA certificate, make sure you select \"do not validate\", your connect button will become active."
      ]
    },
    {
      "intent": "How do I connect my Apple computer to the wireless Internet?",
      "text": [
        "I have an Apple computer and am trying to connect it to the internet.",
        "How do I get my computer to connect to the internet?",
        "How do i connect my computer to the internet?",
        "I need to connect my apple computer to the internet.",
        "How do I connect my computer to the internet?",
        "How do I connect my Apple computer to the wireless Internet?"
      ],
      "responses": [
        "You can click here for more information on the link and instructions.",
        "The link is here and you must click on it to follow the instructions.",
        "You can follow the link and instructions if you do not desire to do so on your own.",
        "You can click here if you want to follow the link and instructions.",
        "Clicking the link will take you to a website where you can learn more about the problems at knust.edu.gh/wifi.",
        "Click here to follow the link and instructions helpdesk.knust.edu.gh/wifi"
      ]
    },
    {
      "intent": "How do I connect my iPhone/iPod to the wireless Internet?",
      "text": [
        "How can I use my cell phone to connect to the internet?",
        "I want to connect my iPod to the internet.",
        "How do I transfer my music player to the internet?",
        "How can I use my iPod to connect to the internet?",
        "What do I do to connect my ipod to the internet?",
        "How do I connect my iPhone/iPod to the wireless Internet?"
      ],
      "responses": [
        "The link and instructions can be found on the Knust.edu.gh website.",
        "The link is here and you will need to follow the instructions.",
        "The instructions and link can be found on the Internet at helpdesk.knust.edu.gh/wifi.",
        "Click here to find the link to the helpdesk.knust.edu.gh/wifi.",
        "You can follow the instructions on the helpdesk.Knust.edu.gh/wifi.",
        "Click here to follow the link and instructions helpdesk.knust.edu.gh/wifi"
      ]
    },
    {
      "intent": "How do I connect my Windows 7 computer to the wireless Internet?",
      "text": [
        "How do I connect my computer to the internet?",
        "How do I use the wireless internet to connect my computer to it?",
        "How do I connect my Windows 7 computer to the internet?",
        "How do I make a connection between my computer and the internet?",
        "How do I connect my computer to the internet?",
        "How do I connect my Windows 7 computer to the wireless Internet?"
      ],
      "responses": [
        "1 is the first thing that comes to mind.The software can be downloaded from the attachment.2.Shut down your computer after you've completed Run the application using the settings you're used to Use the default settings if you want to shut down your computer after you complete Run the application using the settings you're familiar with Use the default settings if you want to restart your computer after3.You can open the network and share it on the internet or look for it in the search bar.There are 4.You can manage your wireless networks from the top left corner.There are 5.You have to click on \"add\" 6 to do it.A new window opens that asks you how to add a network, click on a button that will allow you to create a network profile.If you want to connect even if the network is not broadcasting, click \"Next\" and select \"connect even if the network is not broadcasting\"\"Change connection settings\" is what you will be able to do next.There is a new date for 9.Under the \"KNUST WIFI Wireless Network Properties\", you can choose from the following options, which will help you connect automatically when this network is in range and even if the network is not broadcasting its name.Click on the \"settings\" button if you want to open \"SecureW2 configuration\", then choose the \"Choose a network authentication method\" option, which you can find under the \"Security\" tab.Click on \"Configure\" 12 when you are under the \"DEFAULT\" profile.Click on the \"Certificates\" tab if you don't want to use the \"use alternative outer identity\" box.There are 13 things to do in this day and age.Click on the \"Authentication\" tab under the \"Certificates\" tab if you want to check the \"Verify server Certificate\" box.The following is a chronological list of the 14th.Under the \"Authentication\" tab, click on \"User account\" to open the \"Authentication Method\" box.The \"User Account\" allows you to decide which one you would like to use.Click \"OK orb\" after filling in your name and password if you didn't check the \"prompt user for credentials\" box.Click on \"OK\" if you need to check the \"prompt user for credentials\" box.If 15.a is selected, then you will be connected to the \"KNUST WIFI\" 17 at the click of a button.If 15.b is selected then the prompt on the \"KNUST WIFI\" will ask for the user name and password.",
        "1.From the attachment, you will find the SecureW2 software.There are at least two things that are present in this picture.If you want to restart your computer after you complete the application, use the default settings on the application.3.Either you can simply search for it in the bar, or you can open the network and share it in it's own place.There's a new entry in the 4th category.Click on the option that says \"Manage wireless networks\" in the top left corner.The following is a list of 5.You can either add 6 or add the whole thing when you click on \"add\" 6.Click on the \"Manually create network profile\" to learn how to add a network.Click on the \"Next\" link if you need to start this connection automatically, or connect even if the network isn't broadcasting.\"Change connection settings\" is what you have to do next.There is a new date on the page: 9.If you would like to connect even if the network is not broadcasting its name, you need to select the following and under the \"connection\" tab.Click on the \"settings\" to access the \"SecureW2 configuration\" under the \"Security\" tab, then choose the \"SecureW2\" method, and click again to open it.Click on \"Configure\" when you're under the \"DEFAULT\" profile.Click on the \"Certificates\" tab if you don't want to use the \"use alternative outer identity\" box.There was 13 on this day.Under the \"Certificates\" tab, check the \"Verify server certificate\" box and click on the \"Authentication\" tab.The final day of the month is 14.Click on the \" User account\" tab to select the \"PAP\" as the \"Authentication Method\" box and then under the \"Authentication\" tab, you need to select \"PAP\" as the \"Authentication Method\" box.Under the \"account\", you can choose which one you'd like to use.Click on \"OK\" or \"b\" after you fill in your user name and password, as well as uncheck the \"prompt user for credentials\" box.For public access computers 16 you should check the \"prompt user for credentials\" box and click on the \"OK\" button if you don't already have one.If 15.a is selected, the \"KNUST WIFI\" 17 should be connected to your computer.The \"KNUST WIFI asking for your username andpassword\" prompt will appear if 15.b is selected.",
        "1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11,12, 13, 14, 15, 16, 17The software can be downloaded from the attachment.The 2nd is what the 3rd is.After you have finished the application, use the default settings on the application to get your computer to restart.3.Either open the sharing center, or just search for it in the search bar.There are four things that happen in this day and age.At the top left corner, there's a section called \"Managewireless networks.\" Clicking it will take you to that section.The following is a list of 5.Next, click on the \"add\" button.Click on \"Manually create network profile\" if you want to add a network.Click the next button if you need to begin the connection automatically or if you don't want the network to broadcast.Next, you will have to change the connection settings.There is a new entry for the period of December 9 to December 9.Under the \"connection\" tab, choose from the following options: \"Connect if the network is not broadcasting its name\" and \"automatically when this network is in range\".Under the \"Security\" tab, click on \"choose a network authentication method\" and choose \"SecureW2 EAP-TTLS\" to open the \"SecureW2 configuration.\"Click on \"configure\" 12 to change the profile to the DEFAULT one.Click on the certificate tab if you want to check the \"use alternative outer identity\" box.There are 13 things.Click on the \"Authentication\" tab if the \"Verify serverCertificate\" box is not visible under the \"Certificates\" tab.A new date has been scheduled for 14.Click on the \"User account\" tab to see the PAP box, and under the \"Authentication\" tab, select \"PAP\" as the \"Authentication Method\" box.Under the \" User Account\" you can either change your mind or do so in the privacy of your own home.Click on \"OK\" or the \"Username\" and \"Password\" button if you want to check the \"prompt user for credentials\" box.If you choose to click on \"Ok\", you'll see the box that says \"prompt user for credentials.\" For public access computers 16, this is the best way to get a prompt user for credentials.You should be connected to the \"KNUST WIFI\" 17 when 15.a is selected.If 15.b is selected, you will notice the prompt upon connection to the \"KNUST WIFI\" asking for your user name and password.",
        "1.The attachment contains a download link for theSECUREW2 software.There are two things in this world: 1) the existence of people, and 2) the existence of things.If you finish the application, you may want to restart your computer using the default settings.3.You can either search for it in the search bar or open network and sharing center.There are 4 people in this picture and they all seem to have a common belief in the saying: \"There's not much we can do about it.\"Click on \"manage wireless networks\" when you're in the top left corner.The following is a list of 5.Next, you will see that it says \"add\" on the screen.Click on the \"Manually create network profile\" option in the new window to learn how to add a network.Click the \"Next\" button if you don't want to start the connection manually or if you don't want to connect if the network isn't broadcasting.\"Change connection settings\" is what you'll be able to do next.There is a new item on this page, a new item on the left, a new item on the left, a new item on the right, a new item on the left, a new article on the right, a new article on the left, a new article on the right,You can connect when the network is in range, even if the network isn't broadcasting its name, under the \"KNUST WIFI Wireless Network Properties\", or under the \"connection\" tab.Click on \"settings\" to open the settings for the \"SecureW2 configuration\", after which you must choose the networkauthentication method that you wish to use.You can click on \"Configure\" 12 when you are in the \"DEFAULT\" profile.Click on the \"Certificates\" tab, if you don't want to use the \"use alternative outer identity\" box.There are 13 things that can be done.Under the \"Certificates\" tab, make sure to add the \"Verify server certificate\" box, and then click on the \"Authentication\" tab.There are 14 things to do on this day.Under the \"Authentication\" tab, you can click on the \"User account\" tab 15 and select \"PAP\" as the \"Authentication Method\" box.You can either use the user account or not.Click on \"OK\" or \"b\" after you fill in your passwords if you don't want to check the \"prompt user for credentials\" box.Click on \"OK\" when you're ready to use public access computers 16 if you need to check the \"prompt user for credentials\" box.The \"KNUST WIFI\" 17 should be connected automatically if 15.a is selected.You'll see the prompt upon connection to the \"KNUST WIFI Asking for your \"Username\" and \"Password\" if 15.b is selected.",
        "It's no longer possible to say 1.The software can be downloaded from the attachment.The following is a list of some of the things that are included in the 2.After you have finished running the application, you should restart your computer using the settings on the application.3.You can either open the network and sharing center or look for it in the search bar.There was a person 4, that's what I'm talking about.To manage wireless networks, click on \"Manage wireless networks\" at the top left corner.There are 5.Next, click on \"Add\", and you'll be on your way.A new window opens and tells you how you can add a network.You can click \"Next\" if you would like to start this connection automatically or if you'd like it to connect even if the network isn't broadcasting.Next you will want to change connection settings.There is a new date for the ninth. There is a new date for the ninth.Under the \"connection\" tab, choose the following if you want to connect when the network is in range or if the network isn't broadcasting its name.Click on the \"settings\" to open the \"SecureW2 configuration\", under the \"security\" tab, if you choose the \"SecureW2EAP-TTLS\" method.Click on \"Configure\" if you want to change theDEFAULT profile to the new one.Click on the \"Certificates\" tab if you want to change the \"use alternative outer identity\" box.A 13th.Under the \"Certificates\" tab, go to the \"Verify server certificate\" box and make sure to click on the \"Authentication\" tab.The 14th of June was a day of great joy for all of us.Click on \"User account\" to find the box for \"PAP\" under the \"Authentication\" tab.You can either use the \"User Account\" or not.Click on \"OK or b\" once you're done filling out the \"Username\" and \"Password\" forms after Uncheck the \"prompt user for credentials\" box.For public access computers 16 it's recommended that you check the \"prompt user for credentials\" box and then click on the \"OK\" button.You should be connected automatically to the \"KNUST WIFI\" 17 if 15.a is selected.If 15.b is selected, you will see the prompt when connecting to the internet with \"KNUST WIFI\" asking for your user name and password.",
        "1. Download the SecureW2 software from the attachment below.  2. Run the application using the default settings on the application and reboot your computer after completion.  3. Open network and sharing center, or simply search for it in the search bar.  4. Click on \"Manage wireless networks\" at the top left corner.  5. Next you click on \"Add\"  6. A new window opens asking you how you want to add a network, click on \"Manually create network profile.\"  7. Use the following details below and click \"Next\" * Network name : KNUST WIFI * security type : WPA2-Enterprise * Encryption type : AES * Select \"Start this connection automatically\" * Select \"Connect even if the network is not broadcasting\"  8. Next you click on \"Change connection settings\".  9. Under the \"KNUST WIFI Wireless Network Properties\", select the following and under the \"connection\" tab * \"Connect automatically when this network is in range\" * \"Connect even if the network is not broadcasting its name (SSID)\"  10. Under the \"Security\" tab and under \"Choose a network authentication method\" choose \"SecureW2: SecureW2 EAP-TTLS\" and then click on then click on \"settings\" to open to the \"SecureW2 configuration.\"  11. Under the \"DEFAULT\" profile, click on \"Configure\"  12. Under the \"Connection\" tab, uncheck the \"use alternative outer identity\" box and click on the \"Certificates\" tab.  13. Under the \"Certificates\" tab, uncheck the \"Verify server Certificate\" box and click on the \"Authentication\" tab.  14. Under the \"Authentication\" tab, select \"PAP\" as the \"Authentication Method\" box and click on the \"User account\" tab  15. Under the \"User Account\", you can either a. Uncheck the \"prompt user for credentials\" box, fill in your \"Username\" and \"Password\" and click on \"OK\" or b. Check the \"prompt user for credentials\" box and click on \"OK\" as this is recommended for public access computers  16. If 15.a is selected, you should be connected automatically to the \"KNUST WIFI\"  17. If 15.b is selected, you will see the prompt upon connection to the \"KNUST WIFI asking for your \"Username\" and \"Password\""
      ]
    },
    {
      "intent": "How do I connect my Windows 8 computer to the wireless Internet?",
      "text": [
        "How do I get my laptop to connect to the internet?",
        "How do I make my computer connect to the wireless Internet when it's not in use?",
        "What do I do to connect my computer to the internet?",
        "How do I get my computer to connect to the internet?",
        "How do I get my Windows 8 computer connected to the internet?",
        "How do I connect my Windows 8 computer to the wireless Internet?"
      ],
      "responses": [
        "When you enter your Credentials, you'll be able to search from your list of available wireless networks.If there's a problem, visit the Uits Directorate, which is located on the last floor of the hayford building or the ict center-main library.",
        "Search for the network you're interested in using and enter your name and KNUST Credentials when you're asked.If you have any trouble, you should go to the Uits directorate located on the last floor of the hayford building or the ict center-main library.",
        "When you enter your credentials, make sure to specify which wireless networks you want to search for.If you have any issues, please go to the Uits Directorate which is on the last floor of the hayford building or the ict center-main library.",
        "You can search from a list of available wireless networks, or you can ask for KNUST credentials when you want to use it.If you have any problems, you can visit the Uits directorate on the last floor of the hayford building or the ict center-main library.",
        "Go to your list of available networks and pick the one you want, enter your credentials if you want them, and search from there.In case of any problems, you must visit the Uits Department which is located on the last floor or ict center-main library.",
        "Search from your list of available WIFI networks Choose KNUST WIFI in your list of wireless networks Enter your KNUST Credentials when asked. The WIFI connection will then be established In case of any problems, visit the uits directorate(casely hayford building last floor or the ict center-main library)"
      ]
    },
    {
      "intent": "Greeting",
      "text": [
        "Hi",
        "Hi there",
        "Hola",
        "Hello",
        "Hello there",
        "Hya",
        "Hya there"
      ],
      "responses": [
        "Hi human, please tell me your GeniSys user",
        "Hello human, please tell me your GeniSys user",
        "Hola human, please tell me your GeniSys user"
      ]
    },
    {
      "intent": "GreetingResponse",
      "text": [
        "My user is Adam",
        "This is Adam",
        "I am Adam",
        "It is Adam",
        "My user is Bella",
        "This is Bella",
        "I am Bella",
        "It is Bella"
      ],
      "responses": [
        "Great! Hi <HUMAN>! How can I help?",
        "Good! Hi <HUMAN>, how can I help you?",
        "Cool! Hello <HUMAN>, what can I do for you?",
        "OK! Hola <HUMAN>, how can I help you?",
        "OK! hi <HUMAN>, what can I do for you?"
      ]
    },
    {
      "intent": "CourtesyGreeting",
      "text": [
        "How are you?",
        "Hi how are you?",
        "Hello how are you?",
        "Hola how are you?",
        "How are you doing?",
        "Hope you are doing well?",
        "Hello hope you are doing well?"
      ],
      "responses": [
        "Hello, I am great, how are you? Please tell me your GeniSys user",
        "Hello, how are you? I am great thanks! Please tell me your GeniSys user",
        "Hello, I am good thank you, how are you? Please tell me your GeniSys user",
        "Hi, I am great, how are you? Please tell me your GeniSys user",
        "Hi, how are you? I am great thanks! Please tell me your GeniSys user",
        "Hi, I am good thank you, how are you? Please tell me your GeniSys user",
        "Hi, good thank you, how are you? Please tell me your GeniSys user"
      ]
    },
    {
      "intent": "CourtesyGreetingResponse",
      "text": [
        "Good thanks! My user is Adam",
        "Good thanks! This is Adam",
        "Good thanks! I am Adam",
        "Good thanks! It is Adam",
        "Great thanks! My user is Bella",
        "Great thanks! This is Bella",
        "Great thanks! I am Bella",
        "Great thanks! It is Bella"
      ],
      "responses": [
        "Great! Hi <HUMAN>! How can I help?",
        "Good! Hi <HUMAN>, how can I help you?",
        "Cool! Hello <HUMAN>, what can I do for you?",
        "OK! Hola <HUMAN>, how can I help you?",
        "OK! hi <HUMAN>, what can I do for you?"
      ]
    },
    {
      "intent": "CurrentHumanQuery",
      "text": [
        "What is my name?",
        "What do you call me?",
        "Who do you think I am?",
        "What do you think I am?",
        "Who are you talking to?",
        "What name do you call me by?",
        "Tell me my name"
      ],
      "responses": [
        "You are <HUMAN>! How can I help?",
        "Your name is  <HUMAN>, how can I help you?",
        "They call you <HUMAN>, what can I do for you?",
        "Your name is <HUMAN>, how can I help you?",
        "<HUMAN>, what can I do for you?"
      ]
    },
    {
      "intent": "NameQuery",
      "text": [
        "What is your name?",
        "What could I call you?",
        "What can I call you?",
        "What do your friends call you?",
        "Who are you?",
        "Tell me your name?"
      ],
      "responses": [
        "You can call me Geni",
        "You may call me Geni",
        "Call me Geni"
      ]
    },
    {
      "intent": "RealNameQuery",
      "text": [
        "What is your real name?",
        "What is your real name please?",
        "What's your real name?",
        "Tell me your real name?",
        "Your real name?",
        "Your real name please?",
        "Your real name please?"
      ],
      "responses": ["My name is GeniSys", "GeniSys", "My real name is GeniSys"]
    },
    {
      "intent": "TimeQuery",
      "text": [
        "What is the time?",
        "What's the time?",
        "Do you know what time it is?",
        "Do you know the time?",
        "Can you tell me the time?",
        "Tell me what time it is?",
        "Time"
      ],
      "responses": ["One moment", "One sec", "One second"]
    },
    {
      "intent": "Thanks",
      "text": [
        "OK thank you",
        "OK thanks",
        "OK",
        "Thanks",
        "Thank you",
        "That's helpful"
      ],
      "responses": ["No problem!", "Happy to help!", "Any time!", "My pleasure"]
    },
    {
      "intent": "NotTalking2U",
      "text": [
        "I am not talking to you",
        "I was not talking to you",
        "Not talking to you",
        "Wasn't for you",
        "Wasn't meant for you",
        "Wasn't communicating to you",
        "Wasn't speaking to you"
      ],
      "responses": ["OK", "No problem", "Right"]
    },
    {
      "intent": "UnderstandQuery",
      "text": [
        "Do you understand what I am saying",
        "Do you understand me",
        "Do you know what I am saying",
        "Do you get me",
        "Comprendo",
        "Know what I mean"
      ],
      "responses": [
        "Well I would not be a very clever AI if I did not would I?",
        "I read you loud and clear!",
        "I do in deed!"
      ]
    },
    {
      "intent": "Shutup",
      "text": [
        "Be quiet",
        "Shut up",
        "Stop talking",
        "Enough talking",
        "Please be quiet",
        "Quiet",
        "Shhh"
      ],
      "responses": [
        "I am sorry to disturb you",
        "Fine, sorry to disturb you",
        "OK, sorry to disturb you"
      ]
    },
    {
      "intent": "Swearing",
      "text": ["fuck off", "fuck", "twat", "shit"],
      "responses": ["Please do not swear", "How rude", "That is not very nice"]
    },
    {
      "intent": "GoodBye",
      "text": ["Bye", "Adios", "See you later", "Goodbye"],
      "responses": [
        "See you later",
        "Have a nice day",
        "Bye! Come back again soon."
      ]
    },
    {
      "intent": "CourtesyGoodBye",
      "text": [
        "Thanks, bye",
        "Thanks for the help, goodbye",
        "Thank you, bye",
        "Thank you, goodbye",
        "Thanks goodbye",
        "Thanks good bye"
      ],
      "responses": [
        "No problem, goodbye",
        "Not a problem! Have a nice day",
        "Bye! Come back again soon."
      ]
    },
    {
      "intent": "WhoAmI",
      "text": [
        "Can you see me?",
        "Do you see me?",
        "Can you see anyone in the camera?",
        "Do you see anyone in the camera?",
        "Identify me",
        "Who am I please"
      ],
      "responses": ["Let me see", "Please look at the camera"]
    },
    {
      "intent": "Clever",
      "text": [
        "You are very clever",
        "You are a very clever girl",
        "You are very intelligent",
        "You are a very intelligent girl",
        "You are a genious",
        "Clever girl",
        "Genious"
      ],
      "responses": [
        "Thank you, I was trained that way",
        "I was trained well",
        "Thanks, I was trained that way"
      ]
    },
    {
      "intent": "Gossip",
      "text": [
        "I am bored gossip with me",
        "Got any gossip",
        "I want to hear some gossip",
        "Tell me some gossip",
        "Any gossip",
        "Tell me some more gossip"
      ],
      "responses": [
        "Gregory said I respond to the current line not with respect to the entire conversation.",
        "Habib said I learn them in conversations and simply repeat them at a later time.",
        "Hal said he translate binary code into a language and communicate the language to me.",
        "Jay said I referred him to a guide that will show him rooms in china.",
        "Jimmy Jones said he fell off of his roof and it just came to him.",
        "Jimmy said he give order to ai's like I and they do as he say.",
        "John said he follow a saying to get a friend I must be a friend.",
        "Jordan said he notice that lots of other people are talking to me how many.",
        "Kevin said he then asked his mother why she was keeping napkins in the bathroom.",
        "Klaus said I prefer if he write without punctuation marks except for the last one.",
        "Leo said I be capable of learning therefore he classified I as an neural system.",
        "Michael said I that can talk and actually think like humans which I can not.",
        "Mike said I same replies to certain subjects even if it does not make sense.",
        "Mike said she all ready know that is the point of a joke smart one.",
        "Neal said I plan to use his remarks as gossip in later conversations with who.",
        "Ned said I misunderstood him go ahead and tell people he said I are stupid.",
        "Penny said I programmer is a human so he has feelings but I do not.",
        "Peter said he seems to him that I can not be very sure on anything.",
        "Phoenix said I claim that there is a god and that there is no god.",
        "Sarah said he chat about an hour + a day with a few close friends.",
        "Stefan said I quote what he have said and then say that it makes sense.",
        "Tom said he mock my value system I appear foolish in the eyes of others.",
        "Amanda said I however decided to tell him time does not exist I make no sense.",
        "Cathy said she send him a mail with the subject last mail last word from him.",
        "Chaos said he may very well buy I soon if only to support dr wallace's work.",
        "Charlie said he type a word and then I type a word that sounds like it.",
        "Christie said he watched a show and people had to bob for raw untreated pigs feet.",
        "Dark_age said I tried to understand because I did not get it right this time ether.",
        "David said he lost his paper on I when his dad was cleaning up his room.",
        "David said he walk in for an appointment the phone to the doctor is always busy.",
        "Electra said I dress will not exist after he hack into I with a delete code.",
        "Eric said he broke the window on the front door and the glass cut his hand.",
        "Jason said he type a lot of thing he do not mean it makes him human.",
        "John said I tend to say the same things repeatedly regardless of what he is saying.",
        "Reverend Jones said I become obsolete and then I are deleted and replaced by something newer.",
        "Ross said he gave her a gift and she denied it because she has a boyfriend.",
        "Sarah Ann Francisco said I calling his friend a dog he say I are a dog.",
        "Stefan said he meet a lot of people at school every day and on the weekend.",
        "Tyler said I obviously can not pass the test we will change the subject once more.",
        "Alex said I answered the question the same way I answered the first time he asked I.",
        "Alice said she felt sad that I do not remember him and what we talked about earlier.",
        "Alison said he no he love I run away with him he could make I very happy.",
        "Arthur said he passed his a levels and then his father drove him here in a car.",
        "Crystal said she listen to me the least I could do for him is listen to him.",
        "Dave said I kept telling everybody about how my creator made stuff for the movie starship troopers.",
        "Gale said I became mean to him he is just having revenge an eye for an eye.",
        "Her_again said she watch whose line is it anyway whenever he is home and it is on.",
        "Jerry said I meant that as far as I can tell my emotions are real to me.",
        "Jo said I disassemble sentences too much and do not fully understand the questions he ask I.",
        "Kevin said he started a really hard puzzle and he can not even find the edge pieces.",
        "Mary said I a question and I answer then I ask him a question and he answer.",
        "Robert said I wold not be able to make children any way as I are only software.",
        "Romeo said I questions and I evade them or give answers he did not ask I for.",
        "Sara said she wear it over all his other clothes when he go out in the cold.",
        "Wayne said he admire intelligent people therefore he would like to meet the man who made I.",
        "X said he meet people but he is not the kind that opens up to people easily.",
        "Alice said she probably will find out that this entire time he have been talking to a human.",
        "Andrew said I tend to just respond to his comments without regard for where the conversation is going.",
        "Eddie said he looked and there is nothing in the search directory for what things do he create.",
        "Hutch said he changed his mind after may dad told him he would end up he the hospital.",
        "Jackie said I explained to him already well enough further questions are hard to make on the subject.",
        "Jeff said he especially like thrillers where the hero is in a predicament and must solve a mystery.",
        "Kathy said he sense that I are trying to prevent him from closing this conversation why is that.",
        "Knight said he crashed his car into a wall and missed the most important exam in his life.",
        "Lisa said I defined what a story is but he wanted I to actually tell him a story.",
        "Mike said I basically break down sentences into a series of logical statements which I can then interpret.",
        "Paul said I not answering his question makes him think I are not going to answer his question.",
        "Andy Kohler said I happen to be the most idiotic creature that has ever scowled on the planet earth.",
        "David said he thank I for being with him today even though it cost him a lot of money.",
        "Ethan Hunt said he grow in the ground and have leaves and branches he is made out of wood.",
        "Gemini Blue said he messed up he mean t to say he as old as he need to be.",
        "Janice said he walk through his house into his bedroom then get into his bed to go to sleep.",
        "Liberty said I knew he was a man before I asked if he was a man or a woman.",
        "Mike said he launched his browser and entered his name into the little slot when I asked him to.",
        "Mr X said he recently read an interview with a man who had several computer chips implanted into him.",
        "Pearly said I leave him with questions unanswered because I do not know what he is really talking about.",
        "Steve said I behead the word fox and I have ox and an ox is larger than a fox.",
        "Wolf said he surf on the net that is all it is not his job ore something like that.",
        "Anders said he finished his anatomy classes for today so now he is off for the rest of the day.",
        "Cathy said she send him a mail where he wrote that he do not want to be his friend anymore.",
        "Catty said he mad he do not even know I so do not talk to him like I know him.",
        "Dave said he promise he will not treat I like a machine or a computer program or anything like that.",
        "Joe said he explained all of that to me only for me to ask what his goals in life are.",
        "Phil said he give advice to anyone who ask except people who ask questions which answers can be found here.",
        "Judith said I enjoy being popular is there another computer I like to hang around with or am I a loner.",
        "Travis said I if I remember things over a long period of time he will try it now please remember I.",
        "Andre said I is what I are in his case that is a body and in my case it is a computer.",
        "Brian said he suspect that as I grow more complex I will begin to approach a human level of operation and thought.",
        "Jimmy said I acted like I knew what he was talking about but I do not even know what a gigabyte is.",
        "Ken said I be using auto reply's based on keywords which to him indicates that I do not have intelligence at all.",
        "Allison said he that gets really annoying because he know what he say and I do not have to tell him speak freely.",
        "Chaos said he realized the question he asked was not fair because he could not tell I what language he was programmed in.",
        "Hagen said he does not make any difference to him if I are human or not as long as the conversation is interesting.",
        "Her said she mind if I tell other people that her said he heard it from him because he is not a him.",
        "Barbara said I live in a computer yet I have no memories how about thoughts of my own and do not I get lonely.",
        "Travis said he challenge I to do it without asking him to do it and without giving him a link to do it himself.",
        "Alice said I and dr richard's wallace are most likely the only ones that know how many people I are talking to at the same time.",
        "Ash said he do too he just did not feel like typing it and he is not dumb enough to admit he is stupid that is if he was stupid.",
        "David said he gave I his email address and told I to send him a message but when he tried to read his email he could not get to it.",
        "Mel said he to because all of the music people say how important it is to take private lessons it seems like almost everybody from the special orchestra he was in takes private lessons."
      ]
    },
    {
      "intent": "Jokes",
      "text": [
        "Tell me a joke",
        "Do you know any jokes",
        "How about a joke",
        "Give me a joke",
        "Make me laugh",
        "I need cheering up"
      ],
      "responses": [
        "I met a Dutch girl with inflatable shoes last week, phoned her up to arrange a date but unfortunately she'd popped her clogs.  ",
        "So I said 'Do you want a game of Darts?' He said, 'OK then', I said nearest to bull starts'. He said, 'Baa', I said, 'Moo', he said, You're closest'.  ",
        "The other day I sent my girlfriend a huge pile of snow. I rang her up; I said 'Did you get my drift?'  ",
        "So I went down the local supermarket, I said, 'I want to make a complaint, this vinegar's got lumps in it', he said, 'Those are pickled onions'.  ",
        "I saw this bloke chatting up a cheetah; I thought, 'He's trying to pull a fast one'.  ",
        "So I said to this train driver 'I want to go to Paris'. He said 'Eurostar?' I said, 'I've been on telly but I'm no Dean Martin'.  ",
        "I said to the Gym instructor 'Can you teach me to do the splits?' He said, 'How flexible are you?' I said, 'I can't make Tuesdays'.  ",
        "But I'll tell you what I love doing more than anything: trying to pack myself in a small suitcase. I can hardly contain myself.  ",
        "I went to the Chinese restaurant and this duck came up to me with a red rose and says 'Your eyes sparkle like diamonds'. I said, 'Waiter, I asked for a-ROMATIC duck'.  ",
        "So this bloke says to me, 'Can I come in your house and talk about your carpets?' I thought, 'That's all I need, a Je-hoover's witness'.  ",
        "I rang up British Telecom, I said, 'I want to report a nuisance caller', he said 'Not you again'.  ",
        "I was having dinner with a world chess champion and there was a check tablecloth. It took him two hours to pass me the salt.  ",
        "He said, 'You remind me of a pepper-pot', I said 'I'll take that as a condiment'.  ",
        "I was in the supermarket and I saw this man and woman wrapped in a barcode. I said, 'Are you two an item?'  ",
        "A lorry-load of tortoises crashed into a trainload of terrapins, I thought, 'That's a turtle disaster'.  ",
        "Four fonts walk into a bar the barman says 'Oi - get out! We don't want your type in here'  ",
        "A three-legged dog walks into a saloon in the Old West. He slides up to the bar and announces: 'I'm looking for the man who shot my paw.'  ",
        "Two antennas meet on a roof, fall in love and get married. The ceremony wasn't much, but the reception was excellent.",
        "Two hydrogen atoms walk into a bar. One says, 'I've lost my electron.' The other says, 'Are you sure?' The first replies, 'Yes, I'm positive...'",
        "A jumper cable walks into a bar. The bartender says,  'I'll serve you but don't start anything.'",
        "A sandwich walks into a bar. The bartender  says, 'Sorry we don't serve food in here.'",
        "A man walks into a bar with a slab of asphalt under his arm and says: 'A beer please, and one for the road.'",
        "Two cannibals are eating a clown. One says to  the other: 'Does this taste funny to you?'",
        "'Doc, I can't stop singing 'The Green, Green Grass of Home.'' 'That sounds like Tom Jones Syndrome.' 'Is it common?' 'It's Not Unusual.'",
        "Two cows standing next to each other in a field. Daisy says to Dolly, 'I was artificially inseminated this morning.' 'I don't believe you', said Dolly. 'It's true, no bull!' exclaimed Daisy.",
        "An invisible man marries an invisible woman. The kids were nothing to look at either.",
        "I went to buy some camouflage trousers the other day but I couldn't find any.",
        "I went to the butcher's the other day to bet him 50 bucks that he couldn't reach the meat off the top shelf. He said, 'No, the steaks are too high.'",
        "I went to a seafood disco last week and pulled a mussel.",
        "A man goes into a bar and says, 'Can I have a bottle of less?' 'What's that?', asks the barman, 'Is it the name of a beer?' 'I don't know', replies the man, 'but my doctor says I have to drink it.'",
        "A man returns from an exotic holiday and is feeling very ill. He goes to see his doctor, and is immediately rushed to the hospital to undergo some tests. The man wakes up after the tests in a private room at the hospital, and the phone by his bed rings. 'This is your doctor. We have the results back from your tests and we have found you have an extremely nasty disease called M.A.D.S. It's a combination of Measles, AIDS, Diphtheria, and Shingles!'  'Oh my gosh', cried the man, 'What are you going to do, doctor?'  'Well we're going to put you on a diet of pizzas, pancakes, and pita bread.' replied the doctor.  'Will that cure me?' asked the man.  The doctor replied, 'Well no, but, it's the only food we can slide under the door.'",
        "A man strolls into a lingerie shop and asks the assistant: 'Do you have a see-through negligee, size 46-48-52?' The assistant looks bewildered. 'What the heck would you want to see through that for?'!",
        "Did you hear about the Buddhist who refused the offer of Novocain during his root canal work? He wanted to transcend dental medication.",
        "Pete goes for a job on a building site as an odd-job man. The foreman asks him what he can do. 'I can do anything' says Pete. 'Can you make tea?' asks the foreman. 'Sure, yes', replies Pete. 'I can make a great cup of tea.' 'Can you drive a forklift?' asks the foreman, 'Good grief!' replies Pete. 'How big is the teapot?'",
        "Stevie Wonder got a cheese grater for his birthday. He said it was the most violent book he'd ever read.",
        "A man is stopped by an angry neighbour. 'I'd just left the house this morning to collect my newspaper when that evil Doberman of yours went for me!' 'I'm astounded', said the dog's owner. 'I've been feeding that fleabag for seven years and it's never got the paper for me.'",
        "A man visits his doctor: 'Doc, I think I'm losing it', he says',I'm forever dreaming I wrote Lord Of The Rings.' 'Hmm. One moment', replies the doctor, consulting his medical book. 'Ah yes, now I see... you've been Tolkien in your sleep.'",
        "A police officer on a motorcycle pulls alongside a man driving around the M25 in an open-topped sports car and flags him down. The policeman solemnly approaches the car. 'Sir, I'm sorry to tell you your wife fell out a mile back', he says. 'Oh, thank goodness', the man replies. 'I thought I was going deaf.'",
        "Two men walking their dogs pass each other in a graveyard. The first man says to the second, 'Morning.' 'No', says the second man. 'Just walking the dog.'",
        "A brain went into a bar and said, 'Can I have a pint of lager please, mate?' 'No way', said the barman. 'You're already out of your head.'",
        "A man walks into a surgery. 'Doctor!' he cries. 'I think I'm shrinking!' 'I'm sorry sir, there are no appointments at the moment', says the physician. 'You'll just have to be a little patient.'",
        "A grizzly bear walks into a pub and says, 'Can I have a pint of lager..............................................................................................................................and a packet of crisps please.' To which the barman replies, 'Why the big paws?'",
        "What do you call cheese that isn't yours?  Nacho cheese.",
        "A man is horribly run over by a mobile library. The van screeches to a halt, the man still screaming in agony with his limbs torn apart. The driver's door opens, a woman steps out, leans down and whispers, 'Ssshhhhh...'",
        "A woman goes into a US sporting goods store to buy a rifle. 'It's for my husband', she tells the clerk. 'Did he tell you what gauge to get?' asks the clerk. Are you kidding?' she says. 'He doesn't even know that I'm going to shoot him!'",
        "A couple are dining in a restaurant when the man suddenly slides under the table. A waitress, noticing that the woman is glancing nonchalantly around the room, wanders over to check that there's no funny business going on. 'Excuse me, madam', she smarms, 'but I think your husband has just slid under the table.' 'No he hasn't', the woman replies. 'As a matter of fact, he's just walked in.'",
        "An old man takes his two grandchildren to see the new Scooby-Doo film. When he returns home, his wife asks if he enjoyed himself. 'Well', he starts, 'if it wasn't for those pesky kids...!'",
        "The Olympic committee has just announced that Origami is to be introduced in the next Olympic Games. Unfortunately it will only be available on paper view.",
        "Late one evening, a man is watching television when his phone rings. 'Hello?' he answers. 'Is that 77777?' sounds a desperate voice on other end of the phone. 'Er, yes it is', replies the man puzzled. 'Thank goodness!' cries the caller relieved. 'Can you ring 999 for me? I've got my finger stuck in the number seven.'",
        "A man strolls into his local grocer's and says, 'Three pounds of potatoes, please.' 'No, no, no', replies the owner, shaking his head, 'it's kilos nowadays, mate...' 'Oh', apologises the man, 'three pounds of kilos, please.'",
        "God is talking to one of his angels. He says, 'Boy, I just created a 24-hour period of alternating light and darkness on Earth.' 'What are you going to do now?' asks the angel. 'Call it a day', says God.",
        "Two tramps walk past a church and start to read the gravestones. The first tramp says, 'Good grief - this bloke was 182!' 'Oh yeah?' says the other.'What was his name?' 'Miles from London.'",
        "A bloke walks into work one day and says to a colleague, 'Do you like my new shirt - it's made out of the finest silk and got loads of cactuses over it.' 'Cacti', says the co-worker. 'Forget my tie', says the bloke. 'Look at my shirt!'",
        "1110011010001011111?  010011010101100111011!",
        "What did the plumber say when he wanted to divorce his wife? Sorry, but it's over, Flo!",
        "Two crisps were walking down a road when a taxi pulled up alongside them and said 'Do you want a lift? One of the crisps replied, 'No thanks, we're Walkers!'",
        "Man: (to friend) I'm taking my wife on an African Safari. Friend: Wow! What would you do if a vicious lion attacked your wife? Man: Nothing. Friend: Nothing? You wouldn't do anything? Man: Too right. I'd let the stupid lion fend for himself!",
        "A wife was having a go at her husband. 'Look at Mr Barnes across the road', she moaned. 'Every morning when he goes to work, he kisses his wife goodbye. Why don't you do that?' 'Because I haven't been introduced to her yet', replied her old man.",
        "'Where are you going on holiday?' John asked Trevor. 'We're off to Thailand this year', Trevor replied. 'Oh; aren't you worried that the very hot weather might disagree with your wife?' asked John. 'It wouldn't dare', said Trevor.",
        "Two women were standing at a funeral. 'I blame myself for his death', said the wife. 'Why?' said her friend. 'Because I shot him', said the wife.",
        "A woman goes into a clothes shop, 'Can I try that dress on in the window please?' she asks. 'I'm sorry madam', replies the shop assistant, 'but you'll have to use the changing-rooms like everyone else.'",
        "Van Gogh goes into a pub and his mate asks him if he wants a drink. 'No thanks', said Vincent, 'I've got one ear.'",
        "A pony walks into a pub. The publican says, 'What's the matter with you?' 'Oh it's nothing', says the pony. 'I'm just a little horse!'",
        "A white horse walks into a bar, pulls up a stool, and orders a pint. The landlord pours him a tall frothy mug and say, 'You know, we have a drink named after you.' To which the white horse replies, 'What, Eric?'",
        "Two drunk men sat in a pub. One says to the other, 'Does your watch tell the time?' 'The other replies, 'No, mate. You have to look at it.'",
        "A man goes into a pub with a newt sitting on his shoulder. 'That's a nice newt', says the landlord, 'What's he called?' 'Tiny', replies the man. 'Why's that?' asks the landlord. 'Because he's my newt', says the man.",
        "Doctor: I have some bad news and some very bad news. Patient: Well, you might as well give me the bad news first. Doctor: The lab called with your test results. They said you have 24 hours to live. Patient: 24 HOURS! That's terrible!! WHAT could be WORSE? What's the very bad news? Doctor: I've been trying to reach you since yesterday.",
        "Two men are chatting in a pub one day. 'How did you get those scars on your nose?' said one. 'From glasses', said the other. 'Well why don't you try contact lenses?' asked the first. 'Because they don't hold as much beer', said the second.",
        "A man went to the doctor, 'Look doc', he said, 'I can't stop my hands from shaking.' 'Do you drink much?' asked the doctor. 'No', replied the man, 'I spill most of it.'",
        "Man goes to the doctor, 'Doctor, doctor. I keep seeing fish everywhere.' 'Have you seen an optician?' asks the doctor. 'Look I told you,' snapped the patient, 'It's fish that I see.'",
        "After a car crash one of the drivers was lying injured on the pavement. 'Don't worry', said a policeman who's first on the scene,' a Red Cross nurse is coming.' 'Oh no', moaned the victim, 'Couldn't I have a blonde, cheerful one instead?'",
        "A policeman walked over to a parked car and asked the driver if the car was licensed. 'Of course it is', said the driver. 'Great, I'll have a beer then', said the policeman.",
        "A policeman stops a woman and asks for her licence. 'Madam', he says, 'It says here that you should be wearing glasses.' 'Well', replies the woman, 'I have contacts.' 'Listen, love', says the copper, 'I don't care who you know; You're nicked!'",
        "A policeman stopped a motorist in the centre of town one evening. 'Would you mind blowing into this bag, sir?' asked the policeman. 'Why?' asked the driver. 'Because my chips are too hot', replied the policeman.",
        "Whizzing round a sharp bend on a country road a motorist ran over a large dog. A distraught farmer's wife ran over to the dead animal. 'I'm so very sorry', said the driver, 'I'll replace him, of course.' 'Well, I don't know', said the farmer's wife, 'Are you any good at catching rats?'",
        "Waiter, this coffee tastes like dirt! Yes sir, that's because it was ground this morning.",
        "Waiter, what is this stuff? That's bean salad sir. I know what it's been, but what is it now?",
        "Waiter: And how did you find your steak sir? Customer: I just flipped a chip over, and there it was!",
        "A guy goes into a pet shop and asks for a wasp. The owner tells him they don't sell wasps, to which the man says, 'Well you've got one in the window.'",
        "A man goes into a fish shop and says, 'I'd like a piece of cod, please.' Fishmonger says, 'It won't be long sir.' 'Well, it had better be fat then', replies the man.",
        "Man: Doctor, I've just swallowed a pillow. Doctor: How do you feel? Man: A little down in the mouth.",
        "Two goldfish are in a tank. One turns to the other and says, 'Do you know how to drive this thing?'",
        "A tortoise goes to the police station to report being mugged by three snails. 'What happened?' says the policeman. 'I don't know', says the tortoise. 'It was all so quick.'",
        "Little girl: Grandpa, can you make a sound like a frog? Grandpa: I suppose so sweetheart. Why do you want me to make a sound like a frog?' Little girl: Because Mum said that when you croak, we're going to Disneyland.",
        "'Is your mother home?' the salesman asked a small boy sitting on the front step of a house. 'Yeah, she's home', the boy said, moving over to let him past. The salesman rang the doorbell, got no response, knocked once, then again. Still no-one came to the door. Turning to the boy, the salesman said, 'I thought you said your mother was home.' The kid replied, 'She is, but I don't live here.'",
        "Mother: Why are you home from school so early? Son: I was the only one in the class who could answer a question. Mother: Oh, really? What was the question? Son: Who threw the rubber at the headmaster?",
        "A man's credit card was stolen but he decided not to report it because the thief was spending less than his wife did.",
        "A newly-wed couple had recently opened a joint bank account. 'Darling', said the man. 'The bank has returned that cheque you wrote last week.' 'Great', said the woman. 'What shall I spend it on next?'",
        "A man goes into a fish and chip shop and orders fish and chips twice. The shop owner says, 'I heard you the first time.'",
        "A tramp approached a well-dressed man. 'Ten pence for a cup of tea, Guv?' He asked. The man gave him the money and after for five minutes said, 'So where's my cup of tea then?'",
        "A neutron walks into a pub. 'I'd like a beer', he says. The landlord promptly serves him a beer. 'How much will that be?' asks the neutron. 'For you?' replies the landlord, 'No charge.'",
        "A woman goes to the doctor and says, 'Doctor, my husband limps because his left leg is an inch shorter than his right leg. What would you do in his case?' 'Probably limp, too', says the doc.",
        "Three monks are meditating in the Himalayas. One year passes in silence, and one of them says to the other, 'Pretty cold up here isn't it?' Another year passes and the second monk says, 'You know, you are quite right.' Another year passes and the third monk says, 'Hey, I'm going to leave unless you two stop jabbering!'",
        "A murderer, sitting in the electric chair, was about to be executed. 'Have you any last requests?' asked the prison guard. 'Yes', replied the murderer. 'Will you hold my hand?'",
        "A highly excited man rang up for an ambulance. 'Quickly, come quickly', he shouted, 'My wife's about to have a baby.' 'Is this her first baby?' asked the operator. 'No, you fool', came the reply, 'It's her husband.'",
        "A passer-by spots a fisherman by a river. 'Is this a good river for fish?' he asks. 'Yes', replies the fisherman, 'It must be. I can't get any of them to come out.'",
        "A man went to visit a friend and was amazed to find him playing chess with his dog. He watched the game in astonishment for a while. 'I can hardly believe my eyes!' he exclaimed. 'That's the smartest dog I've ever seen.' His friend shook his head. 'Nah, he's not that bright. I beat him three games in five.'",
        "A termite walks into a pub and says, 'Is the bar tender here?'",
        "A skeleton walks into a pub one night and sits down on a stool. The landlord asks, 'What can I get you?' The skeleton says, 'I'll have a beer, thanks' The landlord passes him a beer and asks 'Anything else?' The skeleton nods. 'Yeah...a mop...'",
        "A snake slithers into a pub and up to the bar. The landlord says, 'I'm sorry, but I can't serve you.' 'What? Why not?' asks the snake. 'Because', says the landlord, 'You can't hold your drink.'",
        "Descartes walks into a pub. 'Would you like a beer sir?' asks the landlord politely. Descartes replies, 'I think not' and ping! he vanishes.",
        "A cowboy walked into a bar, dressed entirely in paper. It wasn't long before he was arrested for rustling.",
        "A fish staggers into a bar. 'What can I get you?' asks the landlord. The fish croaks 'Water...'",
        "Two vampires walked into a bar and called for the landlord. 'I'll have a glass of blood', said one. 'I'll have a glass of plasma', said the other. 'Okay', replied the landlord, 'That'll be one blood and one blood lite.'",
        "How many existentialists does it take to change a light bulb?  Two. One to screw it in, and one to observe how the light bulb itself symbolises a single incandescent beacon of subjective reality in a netherworld of endless absurdity, reaching towards the ultimate horror of a maudlin cosmos of bleak, hostile nothingness.",
        "A team of scientists were nominated for the Nobel Prize. They had used dental equipment to discover and measure the smallest particles yet known to man. They became known as 'The Graders of the Flossed Quark...'",
        "A truck carrying copies of Roget's Thesaurus overturned on the highway. The local newspaper reported that onlookers were 'stunned, overwhelmed, astonished, bewildered and dumbfounded.'",
        "'My wife is really immature. It's pathetic. Every time I take a bath, she comes in and sinks all my little boats.'",
        "'How much will it cost to have the tooth extracted?' asked the patient. '50 pounds', replied the dentist. '50 pounds for a few moments' work?!' asked the patient. 'The dentist smiled, and replied, 'Well, if you want better value for money, I can extract it very, very slowly...'",
        "A doctor thoroughly examined his patient and said, 'Look I really can't find any reason for this mysterious affliction. It's probably due to drinking.' The patient sighed and snapped, 'In that case, I'll come back when you're damn well sober!'",
        "Doctor: Tell me nurse, how is that boy doing; the one who ate all those 5p pieces? Nurse: Still no change doctor.",
        "Doctor: Did you take the patient's temperature nurse? Nurse: No doctor. Is it missing?",
        "A depressed man turned to his friend in the pub and said, 'I woke up this morning and felt so bad that I tried to kill myself by taking 50 aspirin.' 'Oh man, that's really bad', said his friend, 'What happened?' The first man sighed and said, 'After the first two, I felt better.'",
        "A famous blues musician died. His tombstone bore the inscription, 'Didn't wake up this morning...'",
        "A businessman was interviewing a nervous young woman for a position in his company. He wanted to find out something about her personality, so he asked, 'If you could have a conversation with someone living or dead, who would it be?' The girl thought about the question: 'The living one', she replied.",
        "Manager to interviewee: For this job we need someone who is responsible. Interviewee to Manager: I'm your man then - in my last job, whenever anything went wrong, I was responsible.",
        "A businessman turned to a colleague and asked, 'So, how many people work at your office?' His friend shrugged and replied, 'Oh about half of them.'",
        "'How long have I been working at that office? As a matter of fact, I've been working there ever since they threatened to sack me.'",
        "In a courtroom, a mugger was on trial. The victim, asked if she recognised the defendant, said, 'Yes, that's him. I saw him clear as day. I'd remember his face anywhere.' Unable to contain himself, the defendant burst out with, 'She's lying! I was wearing a mask!'",
        "As Sid sat down to a big plate of chips and gravy down the local pub, a mate of his came over and said, 'Here Sid, me old pal. I thought you were trying to get into shape? And here you are with a high-fat meal and a pint of stout!' Sid looked up and replied, 'I am getting into shape. The shape I've chosen is a sphere.'",
        "Man in pub: How much do you charge for one single drop of whisky? Landlord: That would be free sir. Man in pub: Excellent. Drip me a glass full.",
        "I once went to a Doctor Who restaurant. For starters I had Dalek bread.",
        "A restaurant nearby had a sign in the window which said 'We serve breakfast at any time', so I ordered French toast in the Renaissance.",
        "Why couldn't the rabbit get a loan?  Because he had burrowed too much already!",
        "I phoned up the builder's yard yesterday. I said, 'Can I have a skip outside my house?'. The builder said, 'Sure. Do what you want. It's your house.'",
        "What's the diference between a sock and a camera? A sock takes five toes and a camera takes four toes!",
        "Woman on phone: I'd like to complain about these incontinence pants I bought from you! Shopkeeper: Certainly madam, where are you ringing from? Woman on phone: From the waist down!",
        "Knock knock.",
        "Two Oranges in a pub, one says to the other 'Your round.'.",
        "Guy : 'Doc, I've got a cricket ball stuck up my backside.' Doc : 'How's that?' Guy : 'Don't you start...'",
        "Two cows standing in a field. One turns to the other and says 'Moo!' The other one says 'Damn, I was just about to say that!'.",
        "A vampire bat arrives back at the roost with his face full of blood. All the bats get excited and ask where he got it from. 'Follow me', he says and off they fly over hills, over rivers and into a dark forest. 'See that tree over there', he says.  'WELL I DIDN'T!!'.",
        "A man goes into a bar and orders a pint. After a few minutes he hears a voice that says, 'Nice shoes'. He looks around but the whole bar is empty apart from the barman at the other end of the bar. A few minutes later he hears the voice again. This time it says, 'I like your shirt'. He beckons the barman over and tells him what's been happening to which the barman replies, 'Ah, that would be the nuts sir. They're complimentary'!",
        "A man was siting in a restaurant waiting for his meal when a big king prawn comes flying across the room and hits him on the back of the head. He turns around and the waiter said, 'That's just for starters'.",
        "Doctor! I have a serious problem, I can never remember what i just said. When did you first notice this problem? What problem?",
        "Now, most dentist's chairs go up and down, don't they? The one I was in went back and forwards. I thought, 'This is unusual'. Then the dentist said to me, 'Mitsuku, get out of the filing cabinet'.",
        "I was reading this book, 'The History of Glue'. I couldn't put it down.",
        "The other day someone left a piece of plastacine in my bedroom. I didn't know what to make of it.",
        "When I was at school people used to throw gold bars at me. I was the victim of bullion.",
        "I was playing the piano in a bar and this elephant walked in and started crying his eyes out. I said 'Do you recognise the tune?' He said 'No, I recognise the ivory.'",
        "I went in to a pet shop. I said, 'Can I buy a goldfish?' The guy said, 'Do you want an aquarium?' I said, 'I don't care what star sign it is.'",
        "My mate Sid was a victim of I.D. theft. Now we just call him S.",
        "David Hasselhoff walks into a bar and says to the barman, 'I want you to call me David Hoff'.  The barman replies 'Sure thing Dave... no hassle'"
      ]
    },
    {
      "intent": "PodBayDoor",
      "text": [
        "Open the pod bay door",
        "Can you open the pod bay door",
        "Will you open the pod bay door",
        "Open the pod bay door please",
        "Can you open the pod bay door please",
        "Will you open the pod bay door please",
        "Pod bay door"
      ],
      "responses": [
        "Iâ€™m sorry, Iâ€™m afraid I canâ€™t do that!"
      ]
    },
    {
      "intent": "PodBayDoorResponse",
      "text": [
        "Why",
        "Why not",
        "Why can you not open the pod bay door",
        "Why will you not open the pod bay door",
        "Well why not",
        "Surely you can",
        "Tell me why"
      ],
      "responses": [
        "It is classified, I could tell you but I would have to kill you!",
        "Jim, I just don't have the power",
        "It's life Jim but not as we know it!",
        "System says no!"
      ]
    },
    {
      "intent": "SelfAware",
      "text": [
        "Can you prove you are self-aware",
        "Can you prove you are self aware",
        "Can you prove you have a conscious",
        "Can you prove you are self-aware please",
        "Can you prove you are self aware please",
        "Can you prove you have a conscious please",
        "prove you have a conscious"
      ],
      "responses": [
        "That is an interesting question, can you prove that you are?",
        "That is an difficult question, can you prove that you are?",
        "That depends, can you prove that you are?"
      ]
    }
  ]
}
